#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Author:  钉钉或微信pythontesting 技术支持qq群：630011153 144081101
# CreateDate: 2019-2-21

{
'甲日甲子':'''
六甲日生甲子时,败中印绶官生至;
月通木气不寻常,反此而言虚名利。

甲日甲子时,虽甲败在子,暗有癸水生气印绶,兼有官生 
其印,若己土破印,通月气,贵。否则,秀而不实。
'''
'甲子日甲子时':'''子遥巳格,年月无庚辛申酉,丑绊午冲, 
离祖自立,贵。若年月俱寅,逢申酉运,大富后退财。子亥卯 
未年月,行西运,贵。甲辰月亦贵。酉月,只以正官格论,大 
贵。巳午戌月,平常。午月,甲死子冲,尤不吉。乙卯、乙巳 
月,主法死。 ''',
'甲子日甲子时':''' 
    甲寅日甲子时,拱丑中辛,贵。年月无庚辛申酉丑未,大 
贵。再甲寅月,孤克,惟憎道可。亥子年月,四品贵。午月, 
行东北方运,亦贵。如酉丑巳等月,明有官煞,柱但有印,俱 
贵。卯未,身太旺,未免刑伤。乙巳月,受刑。丁亥月,旺中 
恶死。 
    甲辰日甲子时,若水位年月,水泛木浮,主移根换叶;申


}
