#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Author:  钉钉或微信pythontesting 技术支持qq群：630011153 144081101
# 鸣谢 https://github.com/yuangu/sxtwl_cpp/tree/master/python
# CreateDate: 2019-2-21

summarys = {
    '甲日甲子': '''
    六甲日生甲子时，败中印绶官生至；月通木气不寻常，反此而言虚名利。
    甲日甲子时，虽甲败在子(沐浴)，暗有癸水生气印绶，兼有官生其印，若己土破印，通月气，贵。否则，秀而不实。

    甲子日甲子时，子遥巳格，年月无庚辛申酉，丑绊午冲，离祖自立，贵。
    若年月俱寅，逢申酉运，大富后退财。子亥卯未年月，行西运，贵。甲辰月亦贵。
    酉月，只以正官格论，大贵。巳午戌月，平常。午月，甲死子冲，尤不吉。乙卯、乙巳月，主法死。

    甲寅日甲子时，拱丑中辛，贵。年月无庚辛申酉丑未，大贵。再甲寅月，孤克，惟憎道可。
    亥子年月，四品贵。午月，行东北方运，亦贵。如酉丑巳等月，明有官煞，柱但有印，俱贵。
    卯未，身太旺，未免刑伤。乙巳月，受刑。丁亥月，旺中恶死。

    甲辰日甲子时，若水位年月，水泛木浮，主移根换叶；申月，煞星会印，俱贵。
    子月，行水木运，亦贵。酉月正官，大贵。寅午戌月，俱吉。乙卯月，刑折。癸巳月，水火中死。癸亥月，凶死。

    甲午日甲子时，时日并冲，忧伤妻子，月通木气者显贵。纯子午年月，或亥未酉月，俱贵。

    甲申日甲子时，甲胎逢印印化煞，贵。鸳鸯重叠，子嗣难为。若行东南方运，文武职居间。
    亥卯未辰丑申等月，俱贵。乙卯月夭。丁巳月，死不全尸。

    甲戌日甲子时，拱亥天门，会同帝阙，甲长生地也，不可以隔角论。年月通申巳酉丑金气，大贵。
    戊寅年月，主聋哑，或狼虎伤害，见壬则吉。乙卯月，刑死，乙亥月，遭盗死。

    甲子相逢甲子连，拟作蟾宫折桂仙；丑绊并冲官鬼破，功名蹭蹬不周全。
    甲子时逢甲子，就中印绶符同。庚申辛酉若相逢，丑未再兼年月。拱贵暗藏极显，巳午冲破平中。
    果无刑克与空冲，定主超群出众
    ''',

    '甲日乙丑': '''
   六甲日生时乙丑,劫财羊刃不宜有; 柱中逢火带辛金,制伏和平贵亦久。 
   甲日乙丑时,辛金为官,己土为财,丑中暗己,被明乙劫 夺,乙丑金神,若年日时合成火局,得制伏,主德性纯和而贵;无火凶狠;如合水局凶恶损家。 

   劫财羊刃忌时垣,宫内财官锁闭门; 辰未相逢为大吉,如无随意度晨昏。 
   甲日时逢乙丑,库中金玉收藏。贵人天乙劫财伤,皎月云遮光荡。 
   火局南方运贵,金神制伏相当。木枯水盛且平常,背祖离乡晚旺.

   甲子日乙丑时,连珠得合妻贤子贵。春月身旺,财帛破散。夏月甲衰,金神有制,贵。秋生,近侍之贵。丑月最吉,亥、子多凶。 

   甲寅日乙丑时,春贫,秋贵,冬富,夏火制金神,吉。 

   甲辰日乙丑时,主富厚有财,通火气年月,贵。 
   甲午日乙丑时,金神入火局,身弱贫夭。寅戌会火,是一木叠逢火位,不吉。若单寅单戌,或申酉亥月,四五品贵。 
   甲申日乙丑时,带疾平常。子月生,南方运,贵。秋生化煞,天干透印绶,尤贵。 
   甲戌日乙丑时,田连阡陌,贯朽粟陈,但未免先刑。寅年月,父子俱显。子月,西方运,金紫。 
    ''',  

    '甲日丙寅': '''
    六甲日生时丙寅,时居日禄坐食神; 旺壬不见无刑破,福寿康宁富贵人。 
    甲日丙寅时,甲木寅上健旺,丙为食神,寿星得地,柱无 壬夺癸克,通火木月气者贵,忌见官星及申冲禄。

    甲丙相邀入虎乡,福星坐禄显文章; 运逢四柱无伤害,早晚陛迁至宪堂。 
    甲日寅时遇丙,学文福禄班齐。若逢辰戌,两三妻,禄主朝元富贵。 丁午庚申减福,无官惹绊为奇。生来贵显有人提,此命先难后易。

    甲子日丙寅时,日禄居时,青云得路,年月无庚辛金,贵;通木火气极贵。午月行东北方运,五六品贵。
    申月,归禄逢 煞,主大权贵;水局平常。若年月与日时同,大贵。 

    甲寅日丙寅时,年月无巳酉辛丑字,是归禄格,位至一二品。纯木火带土,富贵双全,六卿之职。
    丙子及亥未,卯月, 四五品贵;行西南方运,最吉。亦有酉、丑月贵者,看干透及年何如。 

    甲辰日丙寅时,龙虎拱门,又龙吟虎啸,主贵,或一生近贵,财源或得或失,名利既济未济。未、寅年月,官至六卿; 
    戌月风宪;酉月三品;子、亥、丑月四五品,行西方运,大贵;卯、巳年月平常。 

    甲午日丙寅时,身居绝地,主平。若通水月,木得滋养,吉;火月寿夭,天干比助无妨。 

    甲申日丙寅时,时日并冲,忧伤妻子。若年月日同,大贵;巳、亥二三品;辰、子年月,会水以煞化印,吉;未月财库, 亦吉。 

    甲戌日丙寅时,年月有土则富;有金反复。如有金,须生亥子印月方贵,余月则否。
    ''',

    '甲日丁卯': '''
    六甲日生时丁卯,伤官羊刃真当恼; 纵然月气有扶持,未免为人性不好。 
    甲日丁卯时,伤官羊刃,甲用辛为官,丁字伤之,用巳为财,卯中乙木劫之,主为人凶狠。
    若柱透辛,伤官见官,刑害 百端,运气凶险,不得善终;柱有七煞合刃,行财官印绶,大贵。 

    甲旬六日逢丁卯,重重叠叠怕冲刑; 运行背禄无官贵,到老穷经不许名。 
    甲日时临丁卯,伤官羊刃相随。甲逢丁火化为灰,父母兄弟难倚。 
    祖业田财聚散,妻儿总有刑亏。运行官煞始为奇,性格或嗔或喜。 

     甲子日丁卯时,克剥悭吝,作事进退,不免刑伤妻子,或死他乡。生辰戌丑未月,贵。卯月凶,柱有官煞制亦吉。 

     甲寅日丁卯时,年月木火相停,通明之象,贵。月令坐丑、未贵。乙亥月,文章冠世,官至三品,干支金水全,官印双显贵。 

     甲辰日丁卯时,财帛满目,生计盈余,妻贤子孝,高命论之。春生太旺无制,贫贱残疾。丑、酉月贵。 

     甲午日丁卯时,身坐绝地,凶刑。若生秋冬,寿夭。春夏富贵。甲午月,大贵,运宜东北方。 

     甲申日丁卯时,主武职,风宪权贵。酉月,火木运,中贵。寅、午年月大贵。 

     甲戌日丁卯时,逢亥月,有才学,贵显。羊刃最坏,造化须有制合方吉;身弱无凶,若年月纯煞,甲木秋生,主夭折。
    ''',     

    '甲日戊辰': '''
    六甲日生时戊辰,天财坐库会滋身; 富商巨贾田园盛,月带辛金名利成。 
    甲日戊辰时,天财坐库,时上偏财,遇龙守库,主为商贾发财,田园广盛。八月带禄,财官俱有,富贵双全。忌比肩、羊刃夺财。

    时上偏财不用多,干枝内外细搜罗; 运通财旺官生至,运拙身衰恐受磨。 
    甲日戊辰时遇,柱中要戌相扶。财官运气展良图,喜遇钱龙守库。 
    辛庚透干贵显,壬癸滋助不枯。只怕比劫弟兄多,岁运逢之有祸。

    甲子日戊辰时,主移根换叶,改姓易宗,妻贤子孝,作高 命论。未月,行北方运,贵。酉月,北方运,大贵。 

    甲寅日戊辰时,龙吟虎啸格,贵。纯辰,中贵。纯寅康寿。 亥卯未三合,财旺身强,大贵。酉丑申年月亦吉。 

    甲辰日戊辰时,刑冲发财,妻重子晚,双亲有克。酉月三四品贵。丑月亦贵。地支纯辰,大贵。

    甲午日戊辰时,财多成败,早岁灰心。亥子丑卯午未年月大贵。酉月亦贵。

    甲申日戊辰时,主孤,僧道清高。丑月富贵。寅月尤贵。 
    甲戌日戊辰时,大富,年月扶合亦贵。寅亥年月,三四品贵。但时日并冲克,早年身孤,中年发福。
    ''',       

    '甲日己巳': '''
    六甲日生时己巳,病中财物实难任; 月通火气方为贵,若是身衰亦不禁。 
    甲日己巳时,食旺身衰,甲木巳上病,虽有暗戊为财,丙 为食,不通月气,难任其福。
    甲己为平头煞,生逢春月,身旺 财衰,主骨肉参商,平生作事,弄巧成拙。
    己巳金神有火制伏, 巳酉丑合局,行南方运,名重禄高。柱不见火,残害化气,主凶恶暴亡。 

    甲己中央作土神,时逢辰已脱埃尘; 局中岁运趋炎火,显远功名富贵人。 
    甲日时逢己巳,火临土厚无光。旱苗得雨叶枝强,火局金神旺相。 进士有名无实,常人改祖番庄。为人性格不寻常,运至晚年气象。

    甲子日己巳时,先贫后富,祖业轻微,妻勤子拗。生寅未巳丑年月,虽贵防疾。申子辰戌,大贵。 

    甲寅日己巳时,时日相刑,忧伤妻子。生火年月,有明断之才,掌兵权之职。戊子年月,承袭祖荫,主富。 

    甲辰日己巳时,丰姿敦厚,一生平安,财帛有成。巳酉丑年月,行火金运,贵。 

    甲午月己巳时,金神入火乡,大贵。酉月,行火木运,武职有权。 

    甲申日己巳时,敦厚聪明,善于决断,身孤清贵,不免破刑。 

    甲戌日己巳时,财神贵格,名利两全。子戌年月,五品以上贵。 
    ''',          

    '甲日庚午': '''
    六甲日生时庚午,死处又遭鬼当头; 丁丙不逢生再弱,忙忙贫苦度春秋。 
    甲日庚午时,死地逢鬼,甲木死于午,午头见庚为鬼,不通月气,无救助者,带疾寿促。
    月逢丙寅,身旺庚绝则吉,亦主有始无终。若通木气,主方面,通水气,行东方运,止郎官。

    午时庚申是偏官,制伏相宜不等闲; 身弱煞强无食见,平生谋望主艰难。 
    甲日时逢庚午,柱中喜见寅申。身强煞浅转精神,父母雁 行不顺。 妻子早年刑害,晚年出众超群。平生反复好翻腾,先破后成之命。 

    甲子日庚午时,时日相冲,忧伤妻子,平常。若子午年月及寅戌月生,行西北方运,金紫风宪。 

    甲寅日庚午时,春月有寿。夏月伤官伤尽,财源进退。申有权,酉反复。冬月伤妻子。子未年月煞助印生,四品。 

    甲辰日庚午时,田园乐赏。寅月,行金运,风宪。 

    甲午日庚午时,破祖业发财,禄因财不得善终。寅午戌年月,贵。 

    甲申日庚午时,子辰年月会印。亥卯年月身旺,俱贵。寅戌会伤制煞,甲得寄托,亦贵,运喜金水。 

    甲戌日庚午时,生辰戌月,敦厚,不贵则富。丑月行火土运,金紫风宪,寅月清贵。 
    ''',   

    '甲日辛未': '''
    六甲日生辛未时,官星坐贵最为奇; 月逢金气须荣贵,财禄相停敢断之。 
    甲日辛未时,时贵逢官,甲见辛为官,未有天乙贵;己为财,未中己土得气,若通木气月,有寄托者富;通土气月者, 富贵双全。

    甲逢辛未是财官,平步青云路不难; 不比退毛鸡化凤,得时飞上彩云路。 
    甲日时逢辛未,财官守库相扶。贵人财禄是良图,初苦未终荣富。君子迁官进职,常人丰厚充腴。刑冲破害柱中无,定得青云之路。

    甲子日辛未时,辰戌丑未及己酉月,土金地方,文贵显达。 

    甲寅日辛未时,寅申月贵。纯酉丑年月,大贵。 

    甲辰日辛未时,辰戌丑未月富。巳酉丑子年月贵。 

    甲午日辛未时,春吉,夏凶,秋身弱难任官禄,冬贵。 

    甲申日辛未时,春吉,夏辛苦,秋显达,冬根基别立贵。子丑月大贵。 

    甲戌日辛未时,先刑后贵。寅卯酉丑年月贵,子申年月,位至贵显。 
    ''',       

    '甲日壬申': '''
    六甲生时遇壬申，明伤暗鬼坐其身；柱无丙戊秋冬旺，坎坷飘流无定人。
    甲日壬申时，甲木绝在申，申土壬水长生，庚金建禄，明袅暗鬼，甲旺化鬼为官，犹不免凶暴。
    若生秋庚旺，生冬壬旺，柱无丙戊制伏，漂流之象。若巳午月，大吉。强横透庚，作煞论，运行北方，贵。

    甲日时逢喜遇申，偏官偏印怕刑冲；欲求名利终难定，有救须教运气通。
    甲日时逢壬申，倒食暗鬼相侵。生逢身旺主昌荣，身弱性情不定。
    雁侣六亲少力，谋为自立自成。运行吉地显声名，运弱平常之命。

    甲子日壬申时,申子辰亥月,水泛木漂,移根换叶,玉堂金马之贵。水土运,凶。 

    甲寅日壬申时,旺中有失。辰戌丑未月勾陈得位;寅、午、戌月,偏官有制;秋月,行东南运,俱贵。 

    甲辰日壬申时,寅辰年月,文章显贵。透丙戊尤美。 

    甲午日壬申时,申子辰月,改姓更宗,敦厚之命。午月贵。 

    甲申日壬申时,寅月,身煞两停;卯月,以刃合煞,俱贵。子辰年月,以煞化印;巳午火月,七煞有制,俱吉。最怕煞旺 身弱,大凶。 

    甲戌日壬申时,辰戌丑未月,衣锦有成;亥月学堂;寅月建禄;俱贵。午酉月寿促,不然贫贱。
    ''',      

    '甲日癸酉': '''
    六甲日生时癸酉,暗官明印未希奇；柱中有火无刑破，元命胎生贵可知。
    甲日癸酉时，胎生元命，甲木酉上受胎，为甲生气，明癸为印，暗辛为官，有己土破印，不贵。
    酉为金神，若柱有寅戌，通火气者，德性纯厚而贵。无火见水，凶暴残疾。

    甲日交通癸酉时，金神火局两相宜；运行南地无刑破，富贵荣华事事奇。
    甲日时逢癸酉，为人富贵双全。三奇发福屡升迁，上下相和贵显。
    君子寒门将相，常人置立田园。无伤无破是英贤，此命定居台宪。

    甲子日癸酉时,春生木旺;酉月官纯,贵。若混之以煞, 或煞多,柱中全无火气,凶。 

    甲寅日癸酉时,春生寿,夏反复。秋性不定,多凶。冬平常。丑未月贵。

    甲辰日癸酉时,子戌年月,有财有官,贵。 

    甲午日癸酉时,主孤。生寅午戌月,行东北方郎官。 

    甲申日癸酉时,平常。通火气月,行南运,富贵。申酉年月,多夭。有水化金毒,只作官印论,不作金神亦吉,但主退早。

    甲戌日癸酉时,子戌年月,文章显贵。子午月,不贵即富。
    ''',     

    '甲日甲戌': '''
    六甲日生时甲戌,木遭火局气不舒;为了好善福平常,父母并伤诚可 。 
    甲日甲戌时,甲用丙为食,辛为官,戌上食神入火局,辛有余气,身被火焚,为人好善,平常衣禄。
    甲以戊为父,癸为母,戌上旺甲伤戊,内有暗戊伤癸,戊癸受克,难为二亲。 

    时逢甲戌比肩逢，库有天禄火气冲；鸡鸭同鸣皆聚散，到头心志不相同。
    甲日时通甲戌，比肩带禄相逢。天孤仓库隐其中，酉丑辰支取用。
    无钥冲刑开破，立身多学少成。柱金木火旺火生，先暗后明之命。

    甲子日甲戌时,春寿,夏暴,秋贵,冬,移根换叶,柱见纯亥夹角,虽贵终凶。辰戌丑未,杂气财官,亦吉。

    甲寅日甲戌时,比肩争禄,木气遭焚,四十后渐不如前。甲丙申子年月,大贵。纯戌风宪,午月,行水火运,七八品贵。 

    甲辰日甲戌时,财源稳厚,多凶。春月金火运,官至六品。 

    甲午日甲戌时,春生,贵人扶持。夏,背禄逐马。冬,印缓,吉。纯寅年月,近侍贵。 

    甲申日甲戌时,夹酉官贵,但身孤,发亦不久。春生,木土运,贵。 

    甲戌日甲戌时,背禄逐马,平常。秋生,官煞有气,贵。 辰戌丑未月,吉。卯月凶。
    若丙寅、甲午年月,三甲食二丙,丙夏得时,居寅长生,甲就食见禄,主富贵。
    ''',   

    '甲日乙亥': '''
    六甲日生时乙亥，羊刃反伤为祸害；财官辛戊不相逢，只恐功名不亨泰。
    甲日乙亥时，甲木亥上长生有旺，乙为刃，制克学堂，壬为倒食，亥上建禄。
    甲以金为官，戊己为财，辛金沐浴，戊己衰绝，不能作福。
    生巳酉丑月及见辛，柱有戊字，贵。余虽聪明，功名不遂，艺术人也。

    甲日时逢乙亥强，有官有印不寻常；时来自有高人荐，运至财乡大显扬。
    甲日时逢乙亥，就中壬水相生。时临帝座紫微宫，子嗣螟蛉得用。父母雁行少力，花开结子。

    甲子日乙亥时,成趋乾格,贵。如生申月,煞旺合刃,权贵。酉月正官,柱稍得土助,大贵。辰巳丑未戌月俱吉。年月 纯卯,刃旺则凶。 

    甲寅日乙亥时,辰戌丑未月,富。申酉月,贵,冬,平常。若寅亥月,高贵。 

    甲辰日乙亥时,酉月正官,最贵。辰戌丑未及寅亥年月,俱吉。 

    甲午日乙亥时,卯月羊刃,刑骨肉,身弱不得善终。春生,贵为宰辅。申子戌午年月,行水火运,官至六卿。

    甲申日乙亥时,亥月,学问有成,贵为风宪。申酉月,先贫后富。子月,行水火运,金紫。辰戌丑未,杂气财官;寅月建禄,俱吉。 

    甲戌日乙亥时,春冬生,富,土厚地方显贵。夏,劳力不聚财。秋平常。 
    ''',    

    '乙日丙子': '''
    六乙日生时丙子，伤官坐贵福不全；柱中不见官刑破，方是平生贵禄缘。
    乙日丙子时，六乙鼠贵。乙用庚为官，死于子；见丙为伤，丙暗邀辛化煞为权，柱中不见庚辛，
    无丑绊午冲，方成格，贵。若有上忌及不通月气，无救助者，暴恶贫下，有疾寿促。

    六乙贵格丙子时，如无冲破始为奇；不遇庚申巳酉丑，定乘轩冕拜丹墀。
    乙日时临丙子，伤官伤尽荣昌。亥卯未月不寻常，运至身健旺相。辛庚不见发福，午冲丑绊平常。如逢刑克空一场。此命或衰或旺。

    乙丑日丙子时,身弱平常,无午穿冲,贤德温厚。申酉年月,风宪。寅子,贵显。忌丙寅、己未、甲戌、己丑等月,主凶刑恶死。 

    乙卯日丙子时,高。辰戌丑未亥年月,不见官星,贵。

    乙巳日丙子时,吉。若巳午年月,寿促,不然,身孤劳碌, 纯土,财旺生官,行西运;子辰,行水火运,俱二三品贵。
    申月正官,酉月偏官,卯月建禄,俱吉。忌甲寅月,刑夭。乙酉月下贱。 

    乙未日丙子时,平。若子亥年月,大贵,岁运同。忌巳未月,刑伤,丙申月,身不完死;己丑月,破祖恶死。 

    乙酉日丙子时,贵,身孤,反复起倒,月通水气,不见辛午亦贵。忌戊寅月,大凶;丁巳月,破祖贫;己酉月,金刃死。 

    乙亥日丙子时,化青赤,主福。生庚辰年月,富贵。纯亥,成败。丑月,行南运郎官。巳午西运,极贫。忌壬辰月,刑;乙酉月,破祖高贵,中恶死。 
    ''', 

    '乙日丁丑': '''
    六乙日生时丁丑，食神相助遇财官；月通金气化为福，不是寻常下贱看。
    乙日丁丑时，食会财官，丁为食，庚为官，己为财，丑中有辛金合局，己土得位，如有倚托者，贵。
    通金气月化者，富厚尊重；不通月气，平常。

    仓库时开乙见丁，食神坐库禄财亲。无匙不作朝中客，也是清闲有福人。
    乙日时逢丁丑，寿星发达无疑，身居磨蝎莫嫌迟，库内钱财积聚。
    年时月合发达，空刑妻子难为。双亲雁侣有盈亏，运至牢藏金柜。

    乙丑日丁丑时,秋生有权;主带疾;夏吉,冬平;春旺,贵寿。 

    乙卯日丁丑时,亥月,身旺见辛偏官,柱有丁制,风宪武职。 

    乙巳日丁丑时生,亥卯未寅月,贵。通金气月有倚托者,福重。 

    乙未日丁丑时,辰戌丑未月,富。春寿长,秋名利,夏贫下,冬平常,申年月,武职三品。 

    乙酉日丁丑时,若通木气有倚托者,显贵。申丑年月亦好, 寅亥尤佳。 

    乙亥日丁丑时,亥月,性急有操持,妻贤子孝,官至六七 品。午月长生,年月透官印,大贵。

    ''',    

    '乙日戊寅': '''
    六乙日生时戊寅，败财背禄实伤身；有心无力多成败，止是平常衣禄人。
    六乙日戊寅时，败财背禄，乙用庚为官，寅中有丙，伤官背禄：
    用戊己为财，寅中甲旺财败，为人作事成败平常。通土气者吉。

    乙日寅时仔细推，为人招是又招非；运衰更遇空刑克，劳力劳心无定期。
    乙日戊寅时遇，就是暗损伤财。伤官背禄柱中排，富贵妻儿刑害。
    运旺财官发福，运行比煞兴灾。六亲骨肉少和谐，自立自成自在。

    乙丑日戊寅时高,生子年戌月者,富贵。辰戌,行木火运,威权。 

    乙卯日戊寅时,刑中发福。秋生贵。酉年遇辰戌丑未月,富。卯月建禄,午月印生,透官印,俱吉。 

    乙巳日戊寅时,孤克平常。若年月申庚,正官;丑辛,七煞,俱贵。辰月,北方运,吉。

    乙未日戊寅时,春生有寿。秋贵显。夏平常,冬反复。辰戌且未,俱吉。岁运同。 

    乙酉日戊寅时,春生富,夏平、秋贵、寿促,冬吉。 

    乙亥日戊寅时,春吉,夏劳力,秋冬贵。子丑年月,贵至三品,有起有落,寿永。 
    ''',    

    '乙日己卯': '''
    六乙日生逢己卯，时居日禄财临好；旺通木气贵无疑，金重亦可恼。
    乙日己卯时，禄入庙堂，乙木逢卯建禄，为人秀丽，通木火者贵。见庚辛为伤禄破命，患目疾。
    若生巳酉丑月，平常衣禄。辰戌未，吉。申月亦吉。

    日禄居时格不同，食神则马要相逢；伤官印运皆为吉，官不逢兮禄自丰。
    乙日时临己卯，偏财时禄归迎。辛金酉字不相刑，虎榜定标名姓。
    父母六亲难靠，雁行各自飞腾，文章光耀有才能，无破无冲贵命。

    乙丑日己卯时高,中年大福。春生,身太旺,孤。夏贫。秋有疾。冬温厚。柱不见辛金,吉。若辰戌丑未月,金紫贵。 

    乙卯日己卯时高,春生旺,为僧道,富足。夏平常,不见辛金,吉。秋带疾。冬温厚。卯丑年月,显达高寿。 

    乙巳日己卯时,春孤贫,夏平,秋带疾,冬贵。午辰年月、地支一路相连,尤吉。 

    乙未日己卯时,年月不见庚辛金,贵。秋生,看地厚薄,如生壬戌年月,三四品贵。 

    乙酉日己卯时秀,初年破祖,中主发财,未年孤刑。 

    乙亥日己卯时,生寅巳月,不见庚辛,日禄归时格,显达清贵。纯卯年月,高僧羽士。戌,特达聪明,有财禄。 
    ''',  

    '乙日庚辰': '''
    六乙日生时庚辰，水白金清化象真；壬从辛酉通官贵，却防目疾减精神。
    乙日庚辰时，妻贤子贵。乙合庚化金，若通申巳酉丑月，为人秀丽，主贵，却防目疾。
    如不见化，以壬为印，庚为官，辰土癸水合局，乙木有托，行东南运，贵显平和。

    乙庚相会贵无疑，阴木阳金正合时；运吉身强无冲破，升迁自有贵人提。
    乙日庚辰时正，天官守库乾元，青年虎榜姓名传，禀性温良恭俭。士庶妻贤子贵。财人禄位升迁。南离戊癸火相连。富贵之中当险。

    乙丑日庚辰时,破祖克父,身弱忌疾,通月气者,贵。子申年月,天干透甲戊,合三奇,大贵。 

    乙卯日庚辰时,富贵。通火土年月,大贵。 

    乙巳日庚辰时,作事成败,僧道富贵带疾。常人刑克妻子。申子辰卯巳年月,贵。

    乙未日庚辰时,亥卯身,身旺;巳申,官旺,天干透煞印,皆贵。丑酉纯煞,柱有火制,亦吉。戌丑年月,四库全,大贵。 

    乙酉日庚辰时,亥子年月,干透戊癸,贵。寅巳午月,官煞有制,吉。纯酉化金,主厚福。 

    乙亥日庚辰时,不贵则富。若年月癸戊一化,申卯两旺, 巳丑酉会金,行木土运,位至金紫。 
    ''',     

    '乙日辛巳': '''
    六乙日生时辛巳，金木交争主不仁；有化月中身旺贵，不通无化恐伤人。
    乙日辛巳时，暗金交争，是非日有，若通身旺月，有倚托，化鬼为官，行身旺运，贵。通木气月，行金旺运，大贵。通金气月，行身旺运，亦贵。

    乙巳相伤逢金木，求名求利常反复；六亲骨肉有如无，印绶运乡能发福。
    乙日时逢辛巳，柱中鬼旺身衰。六亲难靠不和谐，谋望有成有败。几度遇凶则吉，信知苦尽甘来。运行身旺印绶怀，富贵时人喝采。

    乙丑日庚辰时,破祖克父,身弱忌疾,通月气者,贵。子申年月,天干透甲戊,合三奇,大贵。 

    乙卯日庚辰时,富贵。通火土年月,大贵。 

    乙巳日庚辰时,作事成败,僧道富贵带疾。常人刑克妻子。 申子辰卯巳年月,贵。 

    乙未日庚辰时,亥卯身,身旺;巳申,官旺,天干透煞印, 皆贵。丑酉纯煞,柱有火制,亦吉。戌丑年月,四库全,大贵。 

    乙酉日庚辰时,亥子年月,干透戊癸,贵。寅巳午月,官煞有制,吉。纯酉化金,主厚福。

    乙亥日庚辰时,不贵则富。若年月癸戊一化,申卯两旺, 巳丑酉会金,行木土运,位至金紫。 
    ''',        

    '乙日壬午': '''
    六乙日生时壬午，印绶生身财食聚；月通水木禄丰盈，不通月气平常数。
    乙日壬午时，印绶学堂，乙木长生在午，见壬为印，用丁为食，己为财，午上丁己建旺，若通水月气者，文章秀丽；不通月气，平常衣禄，通运亦好。

    乙日生逢壬午时，月通水木贵人钦；运行官旺无冲破，家业丰隆事称心。
    乙日时逢壬午，食神印绶同宫。无冲无破不相刑，信是声名响应。词馆清秀高士，文章出众超群，贵人喜见小人憎，中末峥嵘之命。

    乙丑日壬午时,春夏多富贵。秋冬官印,或纯煞透干,尤吉。 

    乙卯日壬午时高,丑月,入杂气财官;申酉月,身煞两停, 俱主显贵。纯午酉年月,三四品;辰戌,平常。 

    乙巳日壬午时吉,春夏富贵。秋冬平常。 

    乙未日壬午时,寅卯身旺,亥子印旺,丑月财官印三奇, 俱主贵显。申月正官,尤吉,若庚午、丁亥年月,食神同窠, 就食见禄,富贵。 

    乙酉日壬午时,春吉。秋夏平常。柱纯乙酉,透庚合化, 或见印助,大贵。 

    乙亥日壬午时,春身旺,夏福厚,秋反复,冬吉庆。
    ''',           

    '乙日癸未': '''
    六乙日生时癸未，入墓之中遇倒伤；马劣财微食见克，一生衣禄主平常。
    倒食食神，己土偏财，破癸癸倒未中丁火之食，平常衣禄。通土气月则吉。

    乙日相逢时癸未，算来离祖不成家；有刑克害多成败，运吉如添锦上花。
    乙日相逢癸未，生逢木墓夭孤。雁行兄弟有如无，心性不常喜怒。
    自立自成事业，六亲骨肉亲疏，贵人得合两相扶，此命先贫后富。

    乙丑日癸未时,凶刑孤独,年月通土气,吉。 

    乙卯日癸未时,改祖离亲,就妻为家。午未年月,贵。春尤贵。 

    乙巳日癸未时,不贵则富,先难后易。纯午、三品贵。辰 戌丑月,俱吉。 

    乙未日癸未时,春,身旺刑伤。秋,官煞旺,科名有分。 冬安稳。夏平常。 

    乙酉日癸未时,身坐煞,春,身旺,吉。夏,身弱煞衰, 贫。秋,煞旺,身能从化,贵。冬平。
    辰戌丑未月,透庚辛, 行金运,贵。一到刃运,退官罢职。 

    乙亥日癸未时,春木旺,刑伤妻子。申月官旺,贵。酉煞旺,年月有火则吉。午未戌年月,一二品贵。冬生稳厚。

    ''',            

    '乙日甲申': '''
    六乙日生时甲申，官星得印位生成；月中通气无冲破，必定荣华仕路人。
    乙日甲申时，官印生身，乙用庚为官，壬为印，申上庚旺
    壬生，身有寄托，通金水月运者贵；不通，身弱官重，虽贵不永。

    乙日相逢时遇甲，长生驿马内相亲；贵人天乙来相助，释却褐衣入紫宸。
    乙日申时逢贵，其间高人见喜。小人称美有奇希，克破冲刑减力。
    身旺运逢吉地，信知两旺财官。有鞍有马有衣冠，定主门庭改换。

    乙丑日甲申时高,纯子辰年月,行东南运,大贵。巳酉丑,贵;中防凶。午未纯,吉。亥卯亦吉。余月平平。 

    乙卯日甲申时,化贵。月通水气无伤破者,贵,不然,富。 

    乙巳日甲申时,身强官旺。春,聪明显达,官至四品。夏,身心劳碌。秋冬眼疾。午年月,行财运,贵。 

    乙未日甲申时,生未酉亥月,聪俊特达,官至二三品。丙丁寅午卯酉年月,伤食制煞,权贵。 

    乙酉日甲申时,官煞混杂,若柱丁火制煞留官则吉。亥卯未酉年月,武职极品;不久;行东南方运,大贵。 

    乙亥日甲申时,时落空亡,主少子。秋生,官居六卿。亥卯年未月,俱吉。 
    ''',          

    '乙日乙酉': '''
    六乙日生时乙酉，得逢金局火为奇；用神遇木重重见，鬼绝寿伤反无依。
    乙日乙酉时，身绝鬼旺，乙以辛为鬼，酉上辛旺乙绝。若通巳酉丑月，化金局者贵。如用神坐木，身旺不化，又见于酉，不夭必贫。

    日干是乙时临酉，假煞为权身旺奇；身弱遇官徒费力，功名须待运通时。
    乙日时临乙酉，诞辰乙木无忧。其中权贵任求谋，无破功名定有。妻子早年克害，财源雨散云收。迁宗移祖免忧愁。中末家资成就。

    乙丑日乙酉时高,生巳酉丑月,合金局,更行西运,大贵。 寅午戌月,贫下。亥卯未月,吉。纯子年月,行南运,一二品贵。
    寅月火金,七品贵。申月水木,金紫贵。 

    乙卯日乙酉时,月通金局者贵。未寅年月,官至一二品。 

    乙巳日乙酉时,春吉。夏,伤官有制,好。秋,木弱金重,夭,不然有疾。冬,福厚亦夭。 
    乙未日乙酉时,拱贵格,无刑破者贵,有申填实则非。亥卯月,行西运,贵。 
    乙酉日乙酉时,旺处自刑,年月火土重,主灾。若通月气, 透出印食,行火木运,大贵。地支纯酉,化成金象,但带印绶, 贵不可言。最怕岁运遇官。 
    乙亥日乙酉时,春生,仁寿格,贵。寅月,行金火运,大贵。 
    ''',    

    '乙日丙戌': '''
    六乙日生时丙戌，鬼败临身有损伤；若不气通身旺月，孤贫劳碌苦难当。
    鬼败临身，戌中有辛余气、丙丁库，食神制煞，若柱透庚，伤官见官，为祸百端；
    年月有寅午(三会)，丙火合局，即一木叠逢火位，主人傲物气高，衣禄平常，残疾，不然寿促。
    通身旺月气者，吉。

    枯木相逢局,逢春叶更生; 晚年方得地,花发再重荣。 乙日丙戌时火库，藏辛遇丑乃吉昌；若也运逢凶克害，算来此命且如常。
    乙日相逢丙戌，伤官库木枝枯。不临辛丑钥匙无。难倚六亲父母，雁侣分飞不睦，于人心悲成疏。
    要知发福改门闾，此命后甜先苦.

    乙丑日丙戌时,春身旺,吉。夏,伤官太重。秋,劳力辛苦。冬亥子,印绶带伤官,极贵。戌月,木火运,七品贵。
    纯戌年月,天干透庚丙者,大贵。寅午合火者夭。

    乙卯日丙戌时,寅卯月,运西运,六七品贵。子月印绶; 丑月杂气,刑出财官,俱贵。

    乙巳日丙戌时,吉。丑戌未年月,风宪六卿。亥月,行东运,翰院清贵。 

    乙未日丙戌时,旺处凶。卯午未戌年月,贵显。 

    乙酉日丙戌时,春身旺,冬印旺,大贵。夏巳午,秋酉戌, 俱贵。亦看天干如何?丁未、甲辰,生计辛苦;一生遇贵。丑月刑。戌吉。 

    乙亥日丙戌时,血疾。亥子卯未寅月,遇贵发福;天干透伤官生财,尤吉。 
    ''',   


    '乙日丁亥': '''
    六乙日生丁亥时，食神印绶亦奇哉；月气水土无财贵，切忌伤妻与子灾。
    乙日丁亥时，死处逢生，乙木死，亥却气壬水为生气印绶，
    乙用丁为食，亥中丁坐无气，喜甲木生，助丁食为福。如遇金局，行水运者，防目疾。
    四柱见财，或行财运、贪财坏印，主破财。戊为财为妻，庚为官为子，亥上庚绝土病，妻衰子少。

    时上生逢亥与丁，食神乙木遇长生；月气相扶为最贵，身衰无倚是常人。
    乙日时逢丁亥，食神印绶相扶。长生得意好无伤，荣显清名贵遇。
    喜逢丁壬化气，运临冠带迁除。无机妙法实难窥，丙己寅申减贵。

    乙丑日丁亥时秀,生壬子申未卯月,干透财印者,才德兼全,职在风宪。年月干支纯金,身衰煞旺,主凶死。 

    乙卯日丁亥时,巳酉丑月偏官,申月正官,俱贵。亥月,东南运,风宪。未月,三合木局,大贵。 

    乙未日丁亥时贵,子亥年月,公侯。春生,行西运,郎官。酉孤,贵。年月木火,主发高科。水土金与日干合化有用者, 俱吉。 

    乙酉日丁亥时,月通金局,行水运,大贵。通木气,发达。土气,称意。 

    乙亥日丁亥时,有财自刑,寅卯身旺,天干透财者富;辰丑,行金火运,贵。亥子申,官印双清,更辅以财。大贵。 
    ''',    

    '丙日戊子': '''
    六丙日生时戊子，财官生旺遇食神；月气相扶为最贵，身衰夫倚是常人。
    丙日戊子时，官旺财生，丙用辛为财，癸为官，丙合辛，戊合癸，子中癸旺辛生，丙火无气。
    若通火气，月有倚托者贵；不通贫下。通木气亦吉。

    活计生涯四季隆，丙逢戊子食官同；无伤晚岁皆成就，吉处遭凶险处通。
    丙子时逢戊子，官星食福同排。午丁未遇且沉埋，交通中年大快。
    父母妻子喜合。胸中隐匿文才。若逢好运一时来，富贵清闲自在。

    丙子日戊子时,寅巳卯未月,木能生火,大贵。冬月,丙火无气,贫夭。戌月,行火土运,五六品贵。忌丁巳月,夭; 己酉月,破家失土,身贱。 

    丙寅日戊子时,生卯丑月,清贵。寅戌,平常。夏月身旺, 柱有水金方吉。子月正官,大贵。忌癸巳月,刑;癸亥月,恶死;己酉月,大败。 

    丙辰日戊子时,丙辰为日德格,喜见官星。若生戌月,身旺最宜,武贵。寅月,行金水运,中贵。申月三合,合煞有印, 贵。
    忌己巳月,凶死;己亥月,自刑死;癸丑月,破祖恶死。 

    丙午日戊子时,丙午为日刃格,要官煞制合。生辰戌丑未月,大富。亥卯未寅年月,大贵,申巳,文贵三品,武贵不永。 
    纯子,为子午双包贵格。忌丁巳月,恶死;丁亥月,自刑恶死;辛丑月,孤独。 

    丙申日戊子时,巳午年月,行东北运,风宪,子月,行木火运,三品。丑七品,酉亥,虽遇贵反贱。忌癸巳月,中年刑。乙酉月,破败。 

    丙戌日戊子时,春生,印绶最吉。夏,身太旺,平常。秋,财旺身衰,有寄托则贵。纯酉年月,文进之贵。忌己亥月,死不全尸;癸丑月,贫夭
    ''',     

    '丙日己丑': '''
    六丙日生时己丑，官鬼相生禄不成；若见申庚并乙旺，不求财禄过平生。
    丙日己丑时，伤官背禄，傲物志高。丙用癸为官，丑中有癸余气，被明暗土伤，柱透癸为祸。若见庚辛，伤官生财，却为福庆。

    丙日财官库里藏，戌辰未字显文章；身衰若也无匙钥，求名求利总平常。
    丙日时逢己丑，伤官财库暗藏。运交未戌不寻常。破出财官必旺。近贵谋夺劫财，算来虽有害。六亲真假少和谐，直断依时莫怪。

    丙子日己丑时,寅亥申辰年月,天干透财印食者贵。 

    丙寅日己丑时,平常,生乙酉月,正财格,有乙庚健旺者贵。巳丑年月,干透官印者贵。 

    丙辰日己丑时,申亥年月,化水则吉;不化寿促,戌月冲库,无人不发。寅午身旺,成火上格,大贵。 

    丙午日己丑时,春月,行火金运,官至极品。夏平,秋富,冬贵,难为妻子,午酉年月,五六品,此月禄生财之验。

    丙申日巳丑时,血疾。申月,文学儒官成。卯贵。子辰会官,寅卯会印,俱吉。 

    丙戌日己丑时高,武刑后发旺。生亥卯月,火金运,大贵。辰未四库全,火土成局,大富。 
    ''',         

    '丙日庚寅': '''
    六丙日生时庚寅，学堂生气助其身；运中有合通金局，必是荣华富贵人。
    丙日庚寅时，生气学堂，丙寅上长生，文章秀气；丙以庚辛为财，寅上庚绝丙旺。若通月气金局者财旺，富贵双全，喜西方运；不通局者财薄。

    丙庚相合遇寅时，险难消除福自随；运至寒门名将相，时来平步上云梯。
    丙日庚寅时准，双亲衰旺离乡。妻儿早害晚荣昌，白虎归山正旺。木有成林松柏，生涯广聚财粮。堆金积玉满高堂，共羡人言上样。

    丙子日庚寅时,生子月,近贵。癸酉月,行水木运,高贵;火木运,五品以上贵。未申、癸午年月,身居武职,大贵,寿浅。 

    丙寅日庚寅时,贵不久。生酉申年月,世裔冷职。子丑寅未,贵显。纯寅尤吉。 

    丙辰日庚寅时,生寅午戌未年月,妻贤子孝,富贵双全。申子,行北运,大贵。酉丑,富。 

    丙午日庚寅时,年月无壬癸子未巳字,飞天禄马,贵。巳酉丑申,主文学,不贵即富。未月,伤官。辰月,先贫后富。亥月,行西运,贵显。 

    丙申日庚寅时,亥卯未、申子辰二局,官印两旺,大贵。巳丑财局,吉。寅午戌火局,平。 

    丙戌日庚寅时,生亥子月,贵显。申酉年月,行北方运; 寅午戌,行官鬼运,俱大贵。若运临死绝,即入黄泉无疑。
    ''',  

    '丙日辛卯': '''
    六丙日生时辛卯,旺木双妻为人巧; 不旺化水死乡中,色欲随身多爱好。 
    丙日辛卯时,败财逢合,丙日卯上沐浴,见辛合神。若身甚旺不得化者,只是为人无礼而贪色欲,
    却好如身弱化水,卯上水死,秀而不实,为人惯巧虚诈。惟丙午、丙寅、春月生, 身旺不化者,文贵显秀。 

    丙辛化水不相当,有助身强大吉昌; 四柱若逢冲克破,劳心劳力过时光。 
    丙日时逢辛卯,贪财坏印难成。财官运步显名声,身弱性情不定。 父母六亲难靠,挺身改祖方成。雁行各自望前程,有破如常之命。 

    丙子日辛卯时,子卯相刑,伤妻害子。年月同,主魁名,近侍之贵。寅、午、丑、戌、天干地支俱合者大贵。 

    丙寅日辛卯时,无祖自立,有肢体疾。寅卯未子月,贵。余月平,岁运同。 

    丙辰日辛卯时,生寅戌月,天月二德,高。巳月,行北方运,贵。酉丑亦贵。亥卯未,大贵。 

    丙午日辛卯时,年月中得癸水官星去刃则吉。子月,伤克妻子,寅酉,性格刚强,不受击触,三四品贵。午戌,行东南运;卯月,行西北运,俱贵。 

    丙申日辛卯时滞,主聪明好酒色,身旺不化者贵。春吉。 冬,行北运,富贵双全。巳丑年月,行东运,二品,午未三品。 

    丙戌日辛卯时,伤妻害子,身旺不化者贵。春,聪明好酒色。冬,行西运,富贵。夏风宪。
    ''',  

    '丙日壬辰': '''
    六丙日生时壬辰,煞星坐库火难亲; 身强反主为官贵,如弱定为贫夭人。 
    丙日壬辰时,水火未济。丙见壬偏官,辰上壬水合局,火 死无光。若生春夏,身旺化鬼为官,复行身旺运,贵。秋冬, 身衰鬼旺,更无倚托,贫下残疾。

    丙日壬辰怕见申,再逢阳水定灾屯; 柱中若得寅午戌,变凶为吉贵绝伦。 

    丙日壬辰时墓,身衰耗鬼当途。雁行难倚不相扶,妻子何须缘误。君子文章福助,常人恩反成疏。运行官禄任谋图,无破不贵即富。

    丙子日壬辰时,辰戌丑未月,偏官有制,吉。亥卯年月, 富贵。寅午,行子运;子,行寅午运,俱贵。不然僧道。 

    丙寅日壬辰时,身煞两旺,寅卯辰丑未年月,大贵。巳午戌年月亦贵。 

    丙辰日壬辰时,身孤有财,主恶死。春生,行北运;夏, 东运,俱贵。秋,南运,官至三品。 

    丙午日壬辰时贵,身旺煞浅,若辰戌丑未月,偏官有制, 贵;无制,平常。 

    丙申日壬辰时,旺中灾。春平,夏福,秋富,冬寿促。若申子辰木局,干透印比助,大贵,食制煞亦贵。嫌煞透无制, 财党煞强,夭死非命。 

    丙戌日壬辰时,凶。卯未年月,运行火土,官至三品,妻贤子孝。辰戌丑月,平稳。寅午子巳年月,风宪。 
    ''',  

    '丙日癸巳': '''
    六丙日生时癸巳,日禄归时又遇官; 不见巳寅壬癸月,功名唾于得何难。 
    丙日癸巳时,日禄归时,丙火巳上见癸为正官,坐贵。柱无壬己并寅亥,冲刑者贵,有则否。官通水旺,丙通木旺,无有不贵。 

    丙日时逢癸巳真,号为正贵喜相亲; 柱中年月无冲破,必是荣华富贵人。丙日时逢癸巳,正官禄马稀奇。算来妻子早难为,官禄冲克最忌。 
    君子文名出众,常人财禄有余。黄金白玉出沉泥,运至时来偏聚。

    丙子日癸巳时,丙禄在已,癸禄在巳,互换禄马,岁月无壬已寅亥冲破,近侍风宪,位至公侯。 

    丙寅日癸巳时,春月,干支无水,文进绣衣,荣妻荫子。 卯戌申酉年月,二三品贵。 

    丙辰日癸巳时,不利祖宗。酉戌寅丑年月,魁罡格,通身 旺,贵。 

    丙午日癸巳时,丑辰月,杂气财官,贵显。寅月,丙长生;已月,丙建禄,天干透财印者大贵,宜戒酒。子,官旺;酉,财旺,俱吉。 

    丙申日癸巳时,身坐偏官、偏财,不贵即富。 

    丙戌日癸巳时,卯戌丑未月,贵,不永。寅亥年月,风宪,嫌冲刑,宜戒酒。
    ''',  


    '丙日甲午': '''
    六丙日生时甲午,格入伏晶要见土; 乐逢戊巳最为祥,火炎太过多辛苦。 
    丙日甲午时,丙火午上太旺,要见己合甲化土,火气伏晶, 明照四方,若不见土难享福。
    生辰戌丑未月,上伏火气,造化 得中贵。年月干上再透戊己,运行金水,贵;不透,通土气运亦贵。通,忌刑破。 

    丙日午时少水灾,浑如炎火又添柴; 柱中见火刑破,中末荣华不必猜。 
    丙日时逢甲午,柱中劫刃伤官。木衰火旺化为灰。四季提纲方贵。 
    君子亨通出入,常人守祖多灾。六亲骨肉少和谐,作事有成有败。

    丙子日甲午时,春生吉;夏无依,秋财旺,冬官贵,少子晚成,火土运发达。 

    丙寅日甲午时,生辰戌丑未月,上伏火气,造化得中贵。午月,火太旺,凶。 

    丙辰日甲午时,寅卯印助,申酉印旺,巳午身旺,亥子官旺,俱吉。然以火土为重,无则福薄。未戌辰丑见,吉。 

    丙午日甲午时,寅午戌月,作倒冲论,二三品贵。子月, 南运,八九品贵。寅月,南运,金紫贵。午月,东方运,近侍贵。 

    丙申日甲午时,不见火土气者福薄。行金水运,贵。 

    丙戌日甲午时,春生吉,夏孤克,秋吉,子少。寅午戌月, 富贵超群。神仙宰相。
    ''',  

    '丙日乙未': '''   
    六丙日生时乙未,火月生人多富贵; 乙为正印局中逢,不见财星方可慰。 
    丙日乙未时,生气印绶,丙见未为印库,若通火气月,贵;不通,柱无财,不行财运,亦作高命论,见则贪财坏印,主平常。冬生,官旺辅印,贵显。 

    未时丙月生无疑,雁伴随缘各自飞;运气若行东与北,平时衣禄自无亏。丙日时临乙未,运行东北荣华。身强财旺莫咨嗟,显贵高堂大厦。 
    君子封妻荫子,常人定好生涯,堆金积玉实堪垮,富贵骑鞍压马。

    丙子日乙未时,春,印绶稳厚。夏平稳,秋反复,冬贵, 岁运同。 

    丙寅日乙未时,生卯未月,印绶格,智慧丰厚,难为妻子。 寅巳子辰年月,贵。 

    丙辰日乙未时,春吉,夏平稳,秋劳碌,冬贵显。巳午月, 行西北运,六七品贵。 

    丙午日乙未时,不贵则富。午戌年月,职居风宪。申子辰, 官星制刃;亥印未,印绶化刃,俱吉。 

    丙申日乙未时,不通火气,不见财星,作好命论。年月子辰会官;亥卯会印,俱贵。 

    丙戌日乙未时,申子辰年月,近侍贵。寅卯巳年月,大贵。 
    ''',      

    '丙日丙申': '''
    六丙日生时丙申,身衰财破比肩分; 暗中鬼旺七煞地,无救何能家道殷。 
    丙日丙申时,财旺身衰,丙逢庚为财,壬为鬼,申庚旺壬生,丙火无气,财须比肩分夺。若不通身旺月者贫下;有倚托 救助,又通身旺月,运再同,贵。 

    二丙相逢时遇申,无刑无破改门庭; 火金销炼多成败,有印方能脱俗伦。 
    丙日时逢申位,比肩阳火迟疑。偏官荣旺是和非,就里妻财恁遂。 祖宗盈亏得失,双亲雁侣难依。时来鞍马家道齐,资财虚名薄利。

    丙子日丙申时,若通火气及寅卯月再行身旺运,吉。年月纯金,弃命就财,亦以吉论。 

    丙寅日丙申时,时日对冲,忧伤妻子,通火气月,行身旺运,吉,亥月,手艺。 

    丙辰日丙申时,寅月,行南运,贵。子,三合官局,天干透印,大贵。亥生透壬,多夭。戌未,平常。 

    丙午日丙申时,主血火厄,后大发。若巳月生,庚辛透露,财星格,武贵。

    丙申日丙申时高,好色。子辰年月,东运,贵;不然,残疾寿促。亥卯未,吉。 

    丙戌日丙申时,柱无壬癸亥子酉字填实,作拱格论,贵。寅戌巳午,身旺无依,僧道。 
    ''',      

    '丙日丁酉': '''
    六丙日生时丁酉,刃生身死为灾咎; 柱中无救定然凶,就财弃命难长寿。 
    丙日丁酉时,刃生身死,丁为刃,辛为财,酉上辛旺丙死, 丁火长生,就财弃命,若无救助,不通身旺月,刃神不见刑冲, 
    为人凶狠,不明礼义,有始无终;通月气,或有救助,为技艺便巧之流。癸卯月生者,癸能破丁刃为官,癸水卯上长生,卯 
    中有旺乙为印,如用神有力,又行水木运,贵显。 

    丙火遇酉不相当,太阳日没少辉光; 四柱若嫌冲克破,六亲刑害走彷徨。 
    丙日时逢丁酉,天元炎火销金。六亲相守不安宁,阻碍前程难进。 日夜思量不足。居官犹自忧贪。若逢巳月改门庭,子午傍人嗔恨。  

    丙子日丁酉时,春稳,夏贵,秋平,冬吉。未申酉亥年月, 大贵。有丑会子,有辰会酉,俱以贵论。 
    丙寅日丁酉时,卯亥未年月,干透官煞者贵。余月有艺,平常。 
    丙辰日丁酉时,寅午戌巳年月,干透煞印者贵。申子会官,干透印比者贵。如年月火土,宜见财则吉。 
    丙午日丁酉时,生巳午戌月,僧道命好;酉月贵;亥子丑寅卯辰官印年月,大贵。 
    丙申日丁酉时,通水木气月,行水木运贵。已午,身旺。亥子,官旺。年月两全者,大贵。 
    丙戌日丁酉时,月通木气,行水运,贵;通金气,行火运,金马玉堂,才名冠世。露庚藏戊,贫夭。 
    ''',   


    '丙日戊戌': '''
    六丙日生时戊戌，火局之中遇食神；月气火通为福寿，不通逢吉亦常人。
    丙日戊戌时，寿永，名利不失。寅亥卯未印及申酉戌已年月生，贵。
    丙寅日戊戌时，庙堂食神，丙以戊为食神寿星，戌上丙火入库，戊土专位，若通火气月及东南运，福厚有寿；不通，平常。

    时上食神局，楼台店舍中；茶房饼酒肆，几度立家风。丙日戌时财库开，少年未遇且沉埋；运通早晚通官爵，设若无官也发财。
    丙日时逢戊戌，就中仓库兼全。重重福禄自天然，富贵妻贤子羡。君子文章早立，常人财物绵延。天孤父母早淹连，辰戌钥匙开显。

    丙子日戊戌时，寿永，名利不失。家亥卯未印及申酉戌已年胜，贵。

    丙子日戊戌时，夏月，福寿双全。春，木克土，食神被枭。寅月，丙戊俱长生，最吉。有申庚制甲，大贵。秋冬火衰贫下。巳申亥年月，风宪极品。

    丙辰日戊戌时，午月，丙火有气，土厚地方，五六品贵。亥月，金火运，风宪。

    丙午日戊戌时，羊刃食神健旺，名利骤发，亥未辰戌年月，西方运，风宪。

    丙申日戊戌时，亥月，东方运，贵。寅午身旺，干透财，吉。丑辰刑冲戌库，发于晚年。

    丙戌日戊戌时贫，若通寅巳午戌火局，福寿双全，大贵。见财亦吉。
    ''',   

    '丙日己亥': '''
    六丙日生时己亥，亥中壬旺被己伤；若通月气方为贵，寅卯不逢主泛常。
    丙日己亥时，鬼旺身绝，丙见己为伤官，壬为正鬼，甲为倒食，亥上有明己，旺壬生甲，丙火绝气，
    若通身旺月有倚托者，化鬼为官，主贵，终亦凶狠。通身旺运亦贵；
    身弱无倚托，不通月气，柱中透出壬字，为祸百端，傲物气高，主平常。

    丙日亥时命最高，犹如兰蕙出蓬蒿；四柱若兼冲克破，求名求利却虚劳。
    丙日时临己亥，若无壬字希奇。命中子少两三妻，就里喜逢天乙。父母雁侣行远，刑空文福难齐。皆因八字有高低，切忌贪财罢职。

    丙子日己亥时，秋冬，平常。未月，行水木运，干透木火者，贵。子月，行东运，大贵。申、亥、丑、戌年月，亦贵。

    丙寅日己亥时，夏生，化鬼为官，妻贤子孝，不贵则富。

    寅卯辰巳申丑年月，或午戌会局，天干更透丙戌字，主大权贵。

    丙辰日己亥时，日德格。寅月生，吉，辰月，为僧道主富，平人孤克。戌月冲辰，巳月冲亥，
    丙旺库，俱吉。卯未会，行金水运，申子会，行木火运，俱贵。

    丙午日己亥时，武贵。寅巳午月生，妻重子晚，不贵即富。秋冬，名利进退，酉午戌，大贵。

    丙申日己亥时，春夏生，移根换叶，就妻改福。秋冬平常。酉月，行东南运，风宪。

    丙戌日己亥时，寅卯巳午，木生火炎，妻伤子少，聪明富贵；酉亥子丑，平常，东运亦贵。
    ''',          

    '丁日庚子': '''
    六丁日生时庚子，身衰鬼旺暗中藏；月无救助多贫夭，得坐身强又吉昌。
    若通身旺月，有倚托者贵，更行身旺运，大贵；反是，贫夭下贱。

    庚子时逢日是丁，火落江湖暗复明；四柱若兼冲克破，读书到老只虚名。
    丁日时逢庚子，日干丁火光辉。火胎金绝有盈亏，妻妾不能全美。
    有克有刑冲破，就中文福难齐。相生相救贵人提，此命先难后易。

    丁丑日庚子时平,通木火气,或行身旺运,贵。亦有亥子年月贵者,以丁火阴柔,不怕水乡故也。 

    丁卯庚子时贫,辰戌丑未,偏官有制,午月干强,春身旺, 俱吉。秋冬平常。忌癸巳月,破祖凶;己未月,刑伤;甲申月,刺面血光死。 

    丁巳日庚子时,春旺,夏强,俱贵。秋冬平常。四季月,制伏得中吉。子辰,行西运,四五品贵。 

    丁未日庚子时,辰戌丑未月,偏官有制。午月干强,贵。 余月有制伏,吉;戊子,文章显秀。忌戊申月,夭;丙戌月,刑;辛丑月,刑凶。 

    丁酉日庚子时,辰戌丑未月,刚明特达,贵。辰巳年月, 贵尊相府。忌甲寅月,破败恶死;癸巳月,离乡恶死;乙酉月刑死。 

    丁亥日庚子时,五十后大旺。辰戌丑未月,吉。寅午年月,贵。忌庚寅月,恶死;庚申月,身不全死;辛酉月,破败。 
    ''',        

    '丁日辛丑': '''
    六丁日生时辛丑,库中财谷多陈朽; 身无依倚不为凶,有托妻贤而富厚。 
    丁日辛丑时,丑为财库,辛为妻财,已为食神,丑旺金局, 暗己得位,丁火无气,若失天时无倚托者,就妻而发;有倚托 救助者,财食丰足。

    辛丑遇丁为宝库,柱无匙钥难言富; 刑冲运至遇高人,发迹他乡名誉著。 
    丁日时逢辛丑,偏财库喜刑冲。若还不显有虚名。 妻子宜尔相庆,父母雁行难睦。家门换改重新,发财发福见中兴。必是荣华之命。 

    丁丑日辛丑时,申酉月,财格,财旺生官,贵。午月,伤财身旺,主官禄。纯子寅,武贵三品。水月,艰辛劳苦。辰月贵戚。 

    丁卯日辛丑时,辰巳未年月,富贵,妻子迟。寅卯印助, 戌库身旺,刑。丑丁,得倚托,大贵。 

    丁巳日辛丑时,因阴人致贵。巳酉丑申年月,财旺生官, 富贵。卯月平常,行此运亦贵。丑月,西南运,大贵。 

    丁未日辛丑时,时日并冲,忧伤妻子。酉月,通水气,吉。岁运同。 

    丁酉日辛丑时,寅卯巳午,身旺有托,主文名高贵,宠遇非常。申酉戌,财旺从之,最吉。亥子,官旺亦吉。 

    丁亥日辛丑时,春印绶,吉,秋生,有火气亦吉,夏太旺,凶。冬官煞旺,吉。未戌月,冲开丑库,富。 
    ''',        

    '丁日壬寅': '''
    六丁日生时壬寅，身去从官化木神；水木月通成局象，尊荣安富贵无伦。
    丁日壬寅时，身去从官，丁壬化木，寅上健旺，若水局之月，大贵；通木月亦贵。如丁未月，行东方运，好。

    丁壬合化入金乡，狗禄蝇名空自忙；节概衰残无足取，眼前骨肉亦参商。
    丁日壬寅时合，化局木旺之乡。月支申酉不相逢，得意高人荐用。父母雁行少力，外人喜笑春风，运逢水木没金踪，贵显荣达之命。

    丁丑日壬寅时化贵。生冬月,官旺,贵。春,印绶,安稳, 夏吉;秋平,行东运好。 

    丁卯日壬寅时,贵化吉。寅卯年月,行金水运,大贵。亥子月,行西运,贵。 

    丁巳日壬寅时,丁死于寅,巳无生意,又被寅刑,有始无终,若行金水运,荣贵。寅午年月,身旺;申子辰,官旺;亥卯未,印旺,俱可言贵。

    丁未日壬寅时,恶死。春生印吉,夏,木火运,发福。秋富,冬贵。酉戌年月,官至三品。亥卯寅戌,文贵,纯卯行金水运,金紫。 

    丁酉日壬寅时,亥未寅卯申子年月,聪明富贵,风宪极品。巳午,宰相。辰月,行金水运;戌月,东方运,俱贵。 

    丁亥日壬寅时,日贵格,配合壬寅,官印俱全,文章显达。子月,大贵,化气凶。
    ''',        

    '丁日癸卯': '''
    六丁日生时癸卯，鬼旺身衰困不禁；倚托月通方论福，不然贫下苦悲心。
    乙为倒食，卯上癸生乙旺，若有倚托救助及身旺月，化鬼为官，吉，柱无运通亦吉；反此贫下，失明血疾，妻灾子少。

    丁丑日逢癸卯生，求名求利且中平；身衰弄巧反成拙，得志须通遇贵人。
    丁日时临癸卯，身衰无倚平常。门中鬼贼耗财粮，守祖须防破荡。父母雁行少靠，妻子不免离乡。运中身旺煞方降，堪许利名荣畅。

    丁丑日癸卯时,辰戌丑未月,制伏得中贵。午月干强,贵。申丑,风宪。 

    丁卯日癸卯时,寅卯月生,印绶带煞,不为凶论;行官运, 贵显。

    丁巳日癸卯时,丑月生,北方运,土厚地方,吉;水秀之地,二三品贵。申酉,用财亦吉。

    丁未日癸卯时,偏官生印。春吉,夏平,秋富,冬贫。 

    丁酉日癸卯时,日时俱坐贵,最吉。春夏身旺,化鬼为官;秋冬身衰,勤苦。巳戌月,贵。纯午丑年月,干透庚己,清贵。 

    丁亥日癸卯时,卯月,印绶,近侍之贵,寅午,京官五六品.
    ''',      

    '丁日甲辰': '''
    六丁日生时甲辰，官星得位印生身；不通月气平为福，有倚扶同禄贵人。 --有误，应该是杀
    丁日甲辰时，印绶官库，甲为印，壬为官，辰中甲木印绶生身，官星合局，若通月气，有倚托者贵，否则平常。春生，喜北运；冬生，喜南运，吉。

    丁日时逢官印同，匙开财库见钱龙；支干四柱无刑破，运至方称富贵翁。
    丁日辰时库旺，其中印绶相生。匙钥戌开喜壬丁，文秀出群超众。骨肉六亲刑克，果成花谢重荣。只争运迟见钱龙，先暗后明之命。

    丁丑日甲辰时吉,亥子月,富贵。申月,东方运;午月, 金水运,俱贵。纯寅,风宪极品。 

    丁卯日甲辰时,辰戌丑未月,孤克,运通发财。丑月,南方运,贵。卯月,金水运,近侍权贵,不利建白。 

    丁巳日甲辰时,凶刑孤克。春印吉。夏秋平常。冬官旺。纯戌,木火运,官居冷职。 

    丁未日甲辰时,丑亥卯未月,印绶,官贵。夏平。辰戌,贵厚。酉午,金水运,大贵。 

    丁酉日甲辰时平,年月不见戌字,日主荣贵格。春生,南运,贵;北运,大贵。年午月支合局,人马化格,尤贵。 

    丁亥日甲辰时,日贵格,官禄得位,必当显达。申辰年月,大贵。午月,东北运;辰月,北方运,俱贵。 
    ''',  

    '丁日乙巳': '''
    六丁日生时乙巳，伤官暗里会枭神；东方运地成虚秀，金水之乡禄贵人。
    丁日乙巳时，丁以壬为官，乙为倒食，巳上壬绝，有明乙倒食，暗戊伤官健旺，为人傲物志高，平常。若通金水月气，贵。运通亦贵。

    丁日巳时怕虎刑，财官运步始能通；好意人情反恶意，先难后易乐从容。
    丁日时临乙巳，破财倒食难通。双亲雁侣且和平，妻子无嗔无闷。君子文学秀气，常人财艺通明。壬庚辛癸若重逢，中末财名足用。

    丁丑日乙巳时,春富,夏孤,秋吉,冬贵。 

    丁卯日乙巳时,春印,夏旺,秋财,冬官,看取用何如? 俱可论吉。午未年月,文章贵显,行官禄运,吉。 

    丁巳日乙巳时,再生巳月,倒冲,亥壬为官,无水填实破格者,主四五品贵。 

    丁未日乙巳时,若人倒冲格,无冲破,贵。巳亥年月,三四品贵。酉丑合财局,富。 

    丁酉日乙巳时,破财倒食,若通金水年月,行金水运,吉。 

    丁亥日乙巳时,时日并冲,忧伤妻子。巳酉丑申子辰,金水二局,财官得用,以富贵论。
    ''',     

    '丁日丙午': '''
    六丁日生逢丙午，日禄喜居时上遇；柱中鼠兔癸无伤，少年腾达青云路。
    丁日丙午时，青云得路。丁火午上建禄，若支无枭破，干无癸刑，禄元纯粹，主贵。如支有子卯，干有癸破禄，遇而不遇。

    午时丁日禄元局，不见官星压众曹；四柱无刑行运吉，青云有路步丹霄。
    丁日时逢丙午，互换禄马光辉。功名煊赫世应希，习学文章主贵。

    丁丑日丙午时平,寅卯戌未年月,贵。酉丑,用财最吉。忌亥子官煞。 

    丁卯日丙午时,旺中有灾,卯字刑破白丁。巳月。西北运,贵;东南,极品有权。寅亥,武职二品。若全子酉,大贵。 

    丁巳日丙午时,丁禄午,丙禄巳,互换禄格,柱无寅亥子字,文章显贵。

    丁未日丙午时贵,破祖而成。年月忌壬癸字。甲申月,财官印三奇;辰月,官库;亥月,官印,俱大贵。 

    丁酉日丙午时平,不利子孙。亥卯未年月,贵。巳酉丑,平。寅午戌,富。 

    丁亥日丙午时平,子月,金水运,郎官。未申酉丑年月, 俱吉。
    ''',          

    '丁日丁未': '''
    六丁日生时丁未，火托木局生有气；衣禄安稳且如常，运见水兮方得地。
    丁日丁未时，火托木局，丁以甲为印绶，未为木库印绶之乡，若柱不见财星，不行财运，月年通亥卯未局，有倚托者，安稳之福。

    二丁相遇未时排，险路中年发福来；运吉贵人相会合，安闲衣禄不须猜。
    丁日时逢丁未，其中仓库沉埋。少年难发等时来，丑未相冲通泰。不靠双亲雁侣，花开收果妻财。时逢寿足福重来，末遇荣华堪快.

    丁丑日丁未时,丑未刑冲,不得善终。年月辰戌,四库全, 贵当极品。申未,三品,法司淡薄清闲。 

    丁卯日丁未时,刑中发。寅卯月,印绶,发财敦厚。辰戌申午,俱吉。 

    丁巳日丁未时,拱禄格贵。年有子字,则午为阙门,得拱大贵。忌空亡填实。年月见财官印,俱吉;财,富;官印,贵。 

    丁未日丁未时,八专太旺,早克父母妻子,衣禄平常,为僧道吉。柱通金水木并金水运,衣禄安稳,大贵。

    丁酉日丁未时,日贵格。若亥卯未寅月生,衣禄敦厚,寅月,金水运,金紫风宪。 

    丁亥日丁未时,卯月,三合印局,贵而有寿,申,财官旺;亥,官旺,俱吉,夏生,丁火有气,儒官,但不免孤贫。
    ''',     

    '丁日戊申': '''
    六丁日生时戊申，天元背禄败其身；月无救助财难发，只是平常衣禄人。
    丁日戊申时，身败背禄，丁以壬为官，申上见戊土伤克，若年月干透，壬，见官为祸，虽有旺庚为财，自败不能制克，
    不通身旺月者平常。喜甲寅年月，忌壬子。

    丁亥日戊申时，日时相害，忧伤妻子。通月气身旺者，贵显。年月戊戌、丁巳，火土太重者目疾。
    丁日戊申时为正，天元气旺显文明；为官虽是甘淡薄，运吉终须家道成；

    丁丑日戊申时,秀贵。未申年月,贵;行东南运,大贵。巳月,西北运,六卿之职。 

    丁卯日戊申时,春,伤官用印;秋,伤官用财,俱吉。夏,比肩;冬,伤官见官,平常。四季月,吉。 

    丁巳日戊申时,不贵即富,未免刑克。夏生,行西北运,贵,秋冬,劳苦。 

    丁未日戊申时;生巳午未戌,身旺贵显。若亥卯会未,子辰会申,俱以贵论。 

    丁酉日戊申时,寅午戌丑辰未月生,伤官伤尽为奇,又日贵格,主登科第,运行金水,腰金衣紫。
    ''',                   


    '丁日己酉': '''
    六丁日生时已酉，学堂遇贵格诚稀；妻子有气食神旺，无破无刑方是奇。
    丁日己酉时，丁火酉上长生，学堂、天乙贵人皆兼得之。丁用己为食，辛为财，酉上明己暗辛生旺，文章秀丽，如见卯乙冲破者不贵。

    丁日酉时终见贵，偏财食遇禄无归；干支生旺凶中吉，冲破财星隐祸机。
    丁日时临己酉，食神旺相生财。清闲福禄自然来，一世为人响快。君子宽洪海量，常人四海情怀。财官双美象中排，一路滔滔无碍。

    丁丑日己酉时,辰巳午未申戍年月贵。 

    丁卯日己酉时,时日并冲,忧伤妻子,通火气吉。忌乙卯字。年月有亥未、巳丑,但一字两合,不以冲论。

    丁巳日己酉时,巳酉丑年月,财旺生官,终身富贵。亥子亦吉。 

    丁未日己酉时,通火气,贵。见卯乙癸字不贵。 

    丁酉日己酉时,刑害孤恶,通木火月,吉。 

    丁亥日己酉时,蹇滞。如戊己丙丁年月,居近侍有权。卯甲乙寅,西北运,贵。
    ''',   

    '丁日庚戌': '''
    六丁日生时庚戌，墓中逢败难成福；若无救助鬼来伤，财帛不聚伤其目。
    丁日庚戌时，墓中逢败，丁以庚辛为财，戌中有丙为败，不成其福。若无救助，叠见癸水，主伤目。

    丁日时逢戌刻真，锁钥无匙库闭门；父母兄弟难依靠，立成家计自殷勤。
    丁日时逢庚戌，火金刑害夭孤。丑辰不遇钥匙无，库闭财能收贮。就合托妻随住，六亲骨肉消疏。
    晚年发福改门闾，此命后甜先苦。

    丁丑日庚戌时,时日相刑,忧伤妻子。若寅亥申酉年月, 官至三品。午未子辰,行金木运亦贵。 
    丁卯日庚戌时,生亥未年月,三合会印,贵。子月,煞印,吉。年月建禄,僧道,主贵。柱无救助,见癸旺,多患目疾, 
    酉月无贵;纯酉戌年月,天干透己甲者贵,中带凶。 

    丁巳日庚戌时,辰巳月,金水运,风宪。癸子、壬亥,南 方运,极品。纯未,西北运,三四品;身旺不行财官运,平常, 为僧道清高。 

    丁未日庚戌时,主刑。亥卯会印,申子辰会官,俱主文贵。午月,建禄,有子冲,凶。若年月用土生财,主富;用财生官, 富贵双全。 

    丁酉日庚戌时,日贵格,近贵,晓艺业,有机谋。酉戌, 六害,骨肉无情,秋月,五六品贵。 

    丁亥日庚戌时,日贵格。巳酉丑年月,四五品贵。寅卯亥, 火金运,位至六卿。 
    ''',  

    '丁日辛亥': '''
    六丁日生时辛亥，财官双美印长生；若通月气极高贵，月不通兮名利轻。
    丁日辛亥时，财官双美，丁用壬为官，辛为财，甲为印，亥上有明辛为财，暗壬为官，生甲为印，
    若通火气有寄托者，大贵，有全美之名；不通，名利乖劣。

    天元丁日亥时富，平步青云路正长；得意退毛鸡化凤，鹏程万里任翱翔。
    丁日时临辛亥，天元禄马同乡。官居进士挂朝裳，必是寒门将相。
    定主妻贤子孝，威仪权柄难量。骤升台省与京堂，固是财官生旺。

    丁丑日辛亥时,秋财旺,夏身旺,春印旺,贵显。冬,官煞太重,恐身弱不能胜任其福。 

    丁卯日辛亥时,时上财官印三奇,再得年月印助财生,皆主大贵。纯子,行木火运,官可六品,巳酉丑月,辛财得局, 方有倚旺,富贵双全。 

    丁巳日辛亥时,时日相冲,忧伤妻子。若通火气,秋生,行东运,贵。辛月得巳亥者,破祖显秀。 

    丁未日辛亥时,亥卯未寅辰午年月,干透正印、正官者,聪明贵显;行西运,极品。巳丑月,风宪。 

    丁酉日辛亥时,贵人捧印,贵。子月,东方运,风宪。柱有巳丑会财,卯未会印,天干透财官印者,大贵。 

    丁亥日辛亥时,日贵格,又三奇全,通月气身旺者贵。卯未三合印局,大贵。
    ''',    

    '戊日壬子':'''
    六戊日生时壬子,月通四季墓中财; 若交身化为真火,水旺运乡忌目灾。 
    戊日壬子时,妻财俱旺,戊以壬为妻财,子上壬水旺,戊土无气,生辰戌丑未月,不化者获财。若合癸化落水旺乡,火不显其光,作事无成,虚而不实,当患目灾。通月气旺者贵。 

    戊日喜逢壬子时,身强官旺正相宜; 运行背却休囚地,荣禄奔波任作为。 
    戊日时逢壬子,此为财旺生官。化为丁丁是漫漫,任子东西走窜。 木旺运中显达,文章秀丽多端。为人博览任追欢,富贵资财万贯。

    戊子日壬子时,财星格。寅卯月,禄马朝元,显贵。酉亥丑年月,西北运,金紫风宪。忌乙卯年刑;癸巳月,旺中刑; 丙午月,旺中受刑。 

    戊寅日壬子时,卯月,正官格,贵。夏乖,秋少顺。丑酉年月,吉。忌己巳月刑,己亥月凶刑。 

    戊辰日壬子时,春,财官旺、贵。夏乖。秋少顺。冬财旺, 行西南运,五六品贵。忌庚辰月,自刑凶;辛巳月,截路凶刑;乙丑月,破败凶。 

    戊午日壬子时,时日并冲,忧伤妻子。巳午年月,风宪。 寅卯亥,六卿。申月,行木火运,侯伯。忌丙午月,身不全; 癸亥,自刑夭。年月子午不杂,丑戌又刑,俱主大贵。 

    戊申日壬子时高,先滞后旺。子酉年月,时上偏官,贵。巳午未戌,身有制化,用财亦专,皆以吉论。
    申酉,食伤生财, 天干透甲乙者,富贵双全。忌己巳月刑害,壬午月夭伤,癸亥 月孤贫。 

    戊戌日壬子时,寅巳午年月,去财留印,三四品贵。经云 :能见义忘利,取印舍财是也。
    子酉,五品翰林。纯酉,水木运,玉堂极贵。忌戊午月,刺面短夭;辛卯月,破败凶刑;癸丑月,受刑;庚午月,贫瞽。    
    ''', 

    '戊日癸丑':'''
    六戊日时生癸丑,却去从妻成配偶; 为人性巧甚聪明,尤好风流嗜花酒。 
    戊日癸丑时,戊以癸为妻财,丑中有癸余气从财,癸旺, 若通月气化为真火,为人聪明;若通土气,主富贵,操权。夏月,行东方运,贵显。 

    化合南离局,财门日月开; 柱中无冲破,福禄自然来。 
    丑时戊癸化合柜,最喜刑冲忌锁闭; 运行忽遇钥匙开,兴旺家门为活计。 
    戊日时逢癸丑,化为炎火生光。运行地水不相当,运到东南兴旺。祖业相离不定,从妻置买田庄。不然骨肉有刑伤,晚景荣华旺相。 

    戊子日癸丑时,戊月生,杂气印绶,天干透丙丁字,不必格局,主富贵。若年月午酉,干透庚乙,乙与庚合,戊与癸合, 
    戊食庚,庚旺于酉,贵于丑,癸为财,乙为官,而印根于午,日时干支为天地合德,贵禄交加,况兼以罗文贵,遇者主极品。

    戊寅日癸丑时,寅已午未戌月,化火吉。秋冬平常。 

    戊辰日癸丑时,寅巳午未戌月,化火得地,申子辰财局亦吉。年月干支纯土,得四库全者贵。 

    戊午日癸丑时,寅戌未午年月,聪明特达威权。 

    戊申日癸丑时,辰戌丑未午月生,富贵爱酒色。夏,东方运,贵。秋冬,财旺生官,若身衰,不夭即贫。

    戊戌日癸丑时,夏生,东方运,贵。辰戌丑未月,富贵操权,好花酒风流。   
    ''', 

    '戊日甲寅':'''
    六戊日生时甲寅,病中又被鬼伤身; 月气若通身旺吉,日干衰弱夭亡人。 
    戊日甲寅时,身衰鬼旺,寅中甲建禄,丙生身,如通身旺月,有倚托有救助,化鬼为官,主富贵;反此贫夭,行身旺运亦吉。 

    寅时戊日自非凡,卓越超群出世间; 定显寒门出将相,如逢身弱是艰难。 
    戊日申寅时正,身强花木逢春。偏官如遇怕刑冲,假煞反为权印。 煞旺身衰减福,难倚雁侣双亲。如行印运福骈臻,定主才 名初顺。

    戊子日甲寅时,先破后发,贵。未月生,干有制伏,贵。 午月无制,聪明近贵。辰戌丑身旺,亥卯煞旺,但有印有制, 贵。纯乙丑年月,金紫。 

    戊寅日甲寅时,身旺,骨肉不同居。午月,刃印带煞;子月,正财党煞,干透制;亥卯未,纯煞身柔,干透刃,运行西南,兵权万里;
    巳丑戌年月,身旺敌煞;酉丑申,制煞,皆主大贵,嫌劫煞克身则凶。 

    戊辰日甲寅时,时上偏官,印绶带煞,柱有庚辛制伏者, 贵。辰戌丑未,身旺亦贵。 

    戊午日甲寅时,曰羊刃,时偏官,以刃合煞,贵。巳酉丑月,刀笔惊人,制伏不宜太过;寅卯辰巳戌子年月,天干有制 
  伏,俱主大贵。 

    戊申日甲寅时,申酉,伤官带煞,土厚地方,贵。丑卯年月,去煞留官,大贵;要行金火运,位极人臣。 

    戊戌日申寅时,辰、戌、丑、未月,行水木运,三品。丑未年月,行金水运,富贵双全。申子、酉子年月俱贵,子孙亦昌。巳午,贵,伤妻害子。 
    ''',     

    '戊日乙卯':'''
    六戊日生时乙卯,四柱伤官不见好; 辛申弗逢冲害无,管取功名直到老。  
    戊日乙卯时,官强身弱,戊用乙为官,卯上乙旺戊死,若无倚托,不通月气,身弱化官为鬼,纵贵寿夭;若通月气,身 旺有托,柱中不见申酉辛庚、伤官甲木破命者贵显。 

    时上生官坐禄权,戊日逢之不等闲; 身强有托方成贵,制合官星贵亦难。 
    戊日时逢乙卯,木冲六合开通。金鸡玉免显光荣,合掌光辉权印。乙酉辛伤雁侣,重花结子方成。困龙得水喜腾云,运至超群出众。

    戊子日乙卯时,时日相刑,伤妻害子,自成自立。年月再遇,主风宪。午酉,四正全,大贵。 

    戊寅日乙卯时,亥子年月,妻贤子孝,贵。卯辰纯,吉;寅巳亦吉。 

    戊辰日乙卯时,身孤,贵。巳卯年月,身强官旺,荣身显祖,子孝妻贤。 

    戊午日乙卯时,刃格,正官去刃为福,子寅卯辰午未申亥年月,俱主贵显。 

    戊申日乙卯时,中年破祖。春贵。夏近贵。秋孤苦。冬富贵双全。巳月,木火运,五品上贵。 

    戊戌日乙卯时,春官旺。夏,官印双全,贵显。秋平。冬贵。戌丑年月,方面三品。戌月,行东方运,孤贫。 
    ''',     

    '戊日丙辰':'''
    六戊日生时丙辰,宝藏财库利于身; 无伤无破何须问,禄马相扶富贵人。 
    戊日丙辰时,官藏财库,戊用壬癸为财,乙木为官,丙为倒食,辰上丙火无气,壬癸入库,乙有余气,若有倚托通月气者,贵显。   

    丙辰时逢为倒食,库中财官锁闭门; 不遇钥匙难发达,诛求劳碌度晨昏。 
    戊日丙辰时正,火光坐库无功。财官锁闭主兴隆,专等钥匙收用。卯戌开放乙癸,富贵名举高崇。运行火土不亨通,作事浑如醉梦。

    戊子日丙辰时,春生近贵。夏辛苦。秋,权高寿促。冬财,通火土,有倚托者贵。 

    戊寅日丙辰时,龙吟虎啸,中年大贵。子月,行北运,土厚地方,官至三品;东运,风宪。丑辰年月,四五品贵。寅午戌年,通土气月,行木火运,极品。 

    戊辰日丙辰时,克父大发,通身旺月,行东北运富;水木月,行身旺运,贵。 

    戊午日丙辰时,亥卯年月,行东北运,富贵。未丑,行西南运,风宪。 

    戊申时丙辰时,辰戌丑未月,贵;不通土气,行土运亦贵。 

    戊戌日丙辰时,时日并冲,忧伤妻子。魁罡,行东北方运, 主权重发福。酉月,近贵无福禄。亥卯未月,以官印论,贵。 
    ''', 

    '戊日丁巳':'''
    六戊日生时丁巳,印生日禄喜归时; 财官不见刑冲破,早际风云会遇期。 
    戊日丁巳时,印绶遇禄,戊禄居巳,见丁为印,巳上丁火帝旺。年月支干不宜见财官,见官损禄,见财损印。不见官煞, 不行财官,行食伤印运,高贵。忌刑冲破害。 


    日干支禄喜归时,不见财官贵可期; 无破禹门三级浪,伫看一跃上天池。 
    戊日时临丁巳,禄元印绶相逢。早夺丹桂步蟾宫,合掌公 卿权柄。 食神伤官运吉。财官相遇无功,双亲雁侣不扶,同有破别 寻格用。


    戊子日丁巳时,贵。子月正财,土厚地方,显达。亥丑年月,官居极品,内臣中,富贵双全。 

    戊寅日丁巳时,寅巳相刑,忧伤妻子。午月,东北运,风宪。寅午年月,四品。 

    戊辰日丁巳时,巳酉丑月,性格风流,威权重大。年月支干不见财官,青云得路。亥戌,行南运,五六品贵。申,行北运,贵。 

    戊午日丁巳时,柱无甲乙卯寅,日禄归时格,又戊禄居时,丁禄居日,为互换禄,高贵;行伤食印运,吉;有甲乙寅卯未字,作官印取用亦贵。 

    戊申日丁巳时,春夏平,秋成败,冬富贵。行木金运,吉。 

    戊戌日丁巳时,无冲破,年月不见财官,不行财官运,贵。寅月,作偏官论,行未申运,贵。子月,透甲亦贵。
    亥卯未, 虽见财官,俱吉,盖归禄格不忌官煞与财,以身旺得之,反为福也。
    ''', 

    '戊日戊午':'''
    六戊日生时戊午,为人凶狠性多刚; 月中化火居官吉,破害刑冲却是良。     
    戊日戊午时,刃神重叠,戊以午为刃,性狠多刚,如见刑冲破害,刃神受制,通月气者,为边疆武职。月中有化气得天时者,大贵。
    年月干见甲,僧道命。年中火旺,戊土被焚,多患脾肺疾。若月不通寅午戌亥,通运气者亦贵。 

    戊逢戊午火离乡,刃旺身强大显扬; 运蹇时乖名未就,平常衣禄度时光。 
    戊日时逢戊午,比肩财禄迟违。妻重子晚任施为,发达运临壬癸。父母雁行少利,六亲冰炭疏 癸有。冲克破始奇特中,末之年主贵。

    戊子日戊午时,巳寅戌月,风宪。夏不熔铸,先刑后发, 旺处多官。灾破祖。 

    戊寅日戊午时,戌月,三合火局,干透癸化,得天时地利者贵。年月申子会水,寅午会火,有既济之妙;辰月亦得;酉伤官;未官印,俱吉。 

    戊辰日戊午时,拱禄格,年月无寅巳甲乙字,贵。卯申, 武职。酉丑亥,行南运,贵。

    戊午日戊午时,先刑后发,多不善终。寅巳午戌年月,印绶,大贵。纯午,武职威权,名重镇藩。亥卯未申,富贵双全。 

    戊申日戊午时,拱贵格,年月逢寅,行南运,风宪;逢午,贵寿;戌文贵。有未填实、巳建禄相连一片者,大贵。

    戊戌日戊午时,大凶。卯午年月,官运,贵显。寅,印绶带煞,变凶为吉。 
    ''', 

    '戊日己未':'''
    六戊日生时己未,羊刃偏官不怕冲; 但是为人多性狠,平生衣禄亦无凶。 
    戊日己未时,羊刃偏官,戊以己为羊刃,甲为偏官,时上明暗二己为刃,甲木未中合局,若见刑冲破害,刃煞有制,主贵。
    通月旺者平常衣禄,二十年,父母俱失;若不通月气,得寅申者贵。 

    未中戊己土成堆,刑害冲来事亦谐;先暗后明凶变吉,贵人提携出尘埋。 
    戊日时临己未,六亲骨肉成疏。喜逢火印暗中扶,甲乙寅卯为主。重谢花开结果,双亲雁行夭孤。自为自立自图谋,赖有贵人扶助。

    戊寅日己未时,时日相穿,忧伤妻子,早苦晚好。月通土气,行财官运,贵;水木月,行身旺运,贵。

    戊寅日己未时,先难后易,贵人提携,不贵即富。年月透甲制刃,地支午未身旺,煞刃双显,主大贵。 

    戊辰日己未时,春冬,行北运,富贵。 

    戊午日己未时,羊刃偏官,主人机谋,寿促,不然,妻子难为重立重成。午亥年月,金土运,贵;申酉,富。 

    戊申日己未时贵,行财官运,发福。嫌寅冲煞有凶。 

    戊戌日己未时,春,官旺,贵。夏印安稳。秋平。冬孤苦。戌月,魁罡格,五六品贵。须年月申子辰会财,寅午印绶,己酉伤官,亥卯官煞,各成局面方吉。 
    ''', 

    '戊日庚申':'''
    六戊日生时庚申,干上食神喜相亲; 不见卯寅兼甲丙,何忧玉带不荣身。 
    戊日庚申时,戊以庚为食,壬癸为财,申上庚旺壬生,戊土有气,无丙火夺食破财,再无寅巳刑冲,生秋月大贵。
    如有丙火甲寅并巳,为人反复,亦有功名。年月干止透甲三奇,地支会局,或止寅辰,皆贵。 

    戊日时临喜见庚,食神合禄主昌荣; 旺中若见刑冲字,活计生涯只许平。 
    戊日庚申时遇,支上生旺奇希。食神生神显光辉,上下流通旺气。 丙字伤枝损叶,甲寅群雁行亏。若无冲破与刑克,积玉堆金之贵。 

    戊子日庚申时,若生亥子月,亦是合禄,贵。 

    戊寅日庚申时,凶刑后发,如生寅月,作食禄制煞论,贵。 

    戊辰日庚申时,专食合禄,纯寅年月,二寅不怕一申冲, 亦贵。 

    戊午日庚申时,未酉丑年月,柱无丙甲卯寅,入合禄格, 行西北运,贵;有甲丙又合神藏煞没,四柱纯阳格,大贵。 

    戊申日庚申时,身禄同窠,富贵两全,子辰未酉年月,行西运,入合禄格,近上三品。年月丑戌,吉:辰戌伤克,平常。亥巳年月,行东北运,一二品贵。 

    戊戌日庚申时,灾疟内,子月,亦合禄格,文贵三品。卯辰年月,大贵。 
    ''',     

    '戊日辛酉':'''
    六戊日生时辛酉,伤官暴败怕时逢; 柱中纵有财星助,有子不成命早终。 
    戊日辛酉时,身败伤官,戊以乙为官,辛为伤官,酉上辛金旺,戊土沐浴,为人性傲行卑。年月透乙,为祸百端;如有乙再行官旺运,刑害不吉。若通生气月,行北运,不贵即富。 

    戊日逢辛号剥官,时上遇之尤堪嫌; 官星若遇生奇祸,尤恐带疾子不全。 
    戊日时临辛酉,伤官不喜官星。财乡运地始亨通,性格心情不定。无破难招祖业,雁侣各自飞腾。妻重子晚始安宁,先难后易之命。

    戊子日辛酉时,巳酉丑月,伤官伤尽,行财旺运,武职风宪。 

    戊寅日辛酉时,通土气月,行西北运,不贵亦富。 

    戊辰日辛酉时,丑未年月,干透财,主贵。若癸巳月,词馆学堂居提纲,主文学高科,寅申巳亥年,则时犯狼藉煞,晚无结果。

    戊午日辛酉时,春夏平常。秋,伤官伤尽,权贵寿促。冬,难为妻子。 

    戊申日辛酉时,戌亥丑子年月,权贵。 

    戊戌日辛酉时,辰戌丑未月,贵。古人以水土败在酉,所以多无结果,或功名早退,或子息不成。观上六日无大官命, 可见伤官时遇不吉。  
    ''',

    '戊日壬戌':'''
    六戊日生时壬戌,身居正位见天财; 若生秋月通身旺,万贯家资不用猜。 
    戊日壬戌时,专位逢财,戊以仁为财,戌上水冠带。春夏壬水无气,财帛不旺;冬则大旺,土虚身弱不能驱驾;惟秋后 戊土坚厚,财命有气,富贵。 

    壬戌时财库内埋,要开专等钥匙来;运行财官生旺地,富贵荣华不用猜。 
    戊时逢壬戌,柱中卯丑为欢。子辰乙贵显财官,出住高人相伴。开库填房就舍,无冲雁侣难完。先贫后富事团圆,不贵仓箱广满。

    戊子日壬戌时,酉申戌月,家财满目。辰、丑冲刑库开,俱吉。 

    戊寅日壬戌时,寅午戌辰年月,金水运,大贵。 

    戊辰日壬戌时,时日并冲,忧伤妻子,如土厚地方,大贵。卯月,火金运,中贵。寅申戌丑,行西南运,极贵。

    戊午日壬戌时,寅午戌月生,时岁火多,以印绶论,未免 孤克,先难后易,不贵即富。卯月,官星制刃,吉。 

    戊申日壬戌时,春贵,夏平,秋富贵,冬平常。 

    戊戌日壬戌时,秋富贵。夏,西运;春,北运;冬,南运, 俱贵。辰丑月,尤吉。 
    ''',

    '戊日癸亥':'''
    六戊日生时癸亥,化火无戌战水乡;若见乙庚丁丑无,反为官命不寻常。     
    戊日癸亥时,戊合癸化火,火绝于亥,战于水乡,不成其象,为人虚秀,多是九流艺术近贵之人,主患目疾。
    戊以甲为鬼,壬癸为财,亥上壬旺甲生,戊土气绝,财帛聚散,若年月干头见乙丁庚旺,为三奇之贵;通土气月身旺,行火木运,吉。 

    戊戌日癸亥时,寅卯午巳丑戌亥年月,天干透乙庚丁字, 清要权贵,宜火土运。 
    戊癸化火亥时生,落照江湖暗复明;卯未月生三合吉,移屋换舍必安宁。 
    戊日时临癸亥,天干化火为奇。乙、庚丁旺喜相宜,定主名声显贵。 四海春风响快,六亲骨肉刑亏。妻贤子孝乐怡怡,无破科名及第。

    戊子日癸亥时,年月不见戊字破格,贵。申子年月,东南运;亥卯,南运,俱贵。巳午未旺,大贵。 

    戊寅日癸亥时,午未月生,化火会局,高命。春,官煞混杂,温饱衣禄。酉丑年月,三品京堂。 

    戊辰日癸亥时,秀。亥子月,财官格,不贵则富。寅卯年月,贵显。夏生,教职。 

    戊午日癸亥时,贵。寅巳年月,土厚水秀地方,六七品贵。卯未辰丑,俱吉。 

    戊申日癸亥时,子未年月,无祖业,因妻致富,不然移根换叶,贫而且贱。 
    ''',

    '己日甲子':'''   
    六己日生时甲子,明见官星暗有财; 倚托若通于月气,平生衣禄自天来。 
    己日甲子时,明官暗财。己用甲为官,癸为财,辛为食, 子为天乙贵,子上有明甲暗癸,辛长生。身若有倚托通月气者, 富贵;若不身旺,行土气运,亦好。 

    己日喜逢甲子时,财官双美贵希奇; 一朝得遇风云会,独步蟾宫折桂枝。 
    己日时临甲子,化生土厚滋基。财官既助显光辉,有似青龙戏水。不遇庚金卯午,为人禄至福齐。常人发福有施为,君子登科及第。

    己丑日甲子时,化贵,午寅年月,夭折;通土气月,贵。 忌甲寅月,贵中恶死。丁未月受刑,丁丑月破祖,失乡恶死。 

    己卯日甲子时,先破祖后旺,或旺中有伤。辰戌丑未月,贵。午,身旺。子,聚贵,亥,官长生,俱大贵。忌己巳月, 破败凶死。庚申月,血光恶死。壬子月,刑害死。 

    己巳日庚子时,辰戌丑未月,风宪三品,要行水木运,西运无成,南运财官无气,虚名薄利,贵而不显。
    子寅年月,东南运,贵显;《神白经》说:“化土生福,但不显。”忌壬寅月,受刑。乙未月,刑伤。癸酉月,夭。 

    己未日甲子时,高身坐官库,辰戌丑未月,吉。寅亥月,官旺,文章振发,贵显易成。巳丑,文贵晚成。寅卯,贫下。 
    忌甲申月,身不完死。丙子月,孤贫。丁丑月,刑害。

    己酉日甲子时,寅申午未丑年月,文贵风宪。午月,东北运,极品。忌庚寅年,破败恶死。己巳月,凶恶。戊戌月,孤单血死。 

    己亥日甲子时,春夏,财官生旺吉;秋冬四季,背禄逐马,凶。寅月,金火运,郎官。午月,东北运,金紫。忌壬寅月,恶死。壬申月,过贫遭刑。癸酉月,破败。 
    ''',

    '己日乙丑':'''   
    六己日生时乙丑,煞星受制不为伤; 柱中身旺多荣贵,无助生人昼夜忙。  
    己日乙丑时,专财逢鬼,丑上有明乙为鬼,暗癸为财。若有倚托通身旺者,贵;通运亦吉。若鬼有助,旺不能任者,衣禄平常。 

    时逢乙丑本身衰,库有财星内伏埋; 不遇钥匙难显达,方知出外称心怀。 
    己日时临乙丑,库中耗鬼兴灾。祖宗产业有盈亏,谋望财去财来。戌未刑冲发福,无匙,来往搬移,双亲雁序事难依, 有救未中取贵。

    己丑日乙丑时,时上偏官,居武职都阃,还看地方断之。卯月金水运,六七品贵。 

    己卯日乙丑时,子申月,行金土运,侯伯。巳酉丑戌年月, 俱吉。 

    己巳日乙丑时,寅卯月,偏官格。无酉戌字,文进贵命。 

    己未日乙丑时,时日并冲,妻生财可也。卯午年月,金神 入火乡,西南运,贵。辰戌四季全,大贵。干透丁辛,纯阴亦贵。 

    己酉日乙丑时,卯月,偏官。辰月,财煞,贵。申酉,伤官伤尽。巳午,印绶,俱贵。丑戌,亦贵。 

    己亥日乙丑时,卯月,大贵。申月,水木运,风宪、方面。 
    ''',

    '己日丙寅':'''   
    六己日生时丙寅,暗官明印旺其身; 月通木气无冲破,贵倚三台八位成。 
    己日丙寅时,官印生旺。己用甲为官,丙为印,寅上甲旺丙生。如果无破、通木局月气者,大贵。喜行木火,不宜金水, 岁君同。    
    
    己日丙寅时异常,少年未遇富文章; 运行卯地生明月,平步青云到帝乡。 
    己日丙寅时正,官星印绶长生。学堂三合喜光荣,博览文章聪俊。年月无冲无破,定应金榜题名。运行官旺主亨通,上等高人之命。    
    
    己丑日丙寅时,春官旺,夏印旺,秋既济,冬平。辰戌年月,文贵显达。纯丑,寿高。戌月,木火运,五、六品贵。 
    
    己卯日丙寅时,午辰年月,文章显达,大贵。寅午,官至三品。 
    
    己巳日丙寅时,先刑后旺。寅月,正官格,文章显贵。亥子水,水运,贵。纯戌,武职三品。年月申亥四生局全,大贵,或不善终。 

    己未日丙寅时,生土厚地,方贵。水木年月,行东北运, 贵。一云多庶出过房,或父不见生。 
    
    己酉日丙寅时,月通木火局,贵;木火运,亦荣达。 
    
    己亥日丙寅时,春生官旺,贵;夏秋平;冬财旺,吉。寅申丑巳午辰戌年月贵。《神白经》云:“火木象贵。” 
    ''',

    '己日丁卯':'''   
    六己日生时丁卯,支干暗鬼枭虚神; 柱中有助方为福,无助难为显达人。 
    己日丁卯时,己以丁为印,乙为鬼,卯上明丁暗乙。若岁月中无救助倚托者,虚秀不实,有成有败。月中见辛制伏身旺者,贵;运旺,亦吉。    
        
    己亥日丁卯时,秋生,偏官有制,富贵。春寿促。夏身旺, 吉。冬平常。辰戌丑未月,贵。 
    己日卯时福自摧,求名求利总不宜; 身宫但有刑克字,离乡别井走东西。 
    己日时逢丁卯,倒食偏官交加,酉庚辛破受波渣,思想不能通达。父母雁行难望,落花后立根芽。圆亏离祖可成家,发迹山林涧下。
    
    己丑日丁卯时,申子辰,武职。亥卯未,荣富。巳酉丑,行东北运,吉。 
    
    己卯日丁卯时,巳酉年月,制伏得宜。庚申合煞,文进大贵。子月,刑煞遇贵,主兵权或法官。地支纯印或三合木局,运行寅,混官再遇流年冲运,凶死。 
    
    己巳日丁卯时,无冲破,富贵;寅午辰年月,刑伤不利。亥月,木火运,贵。若春生透甲乙者,官煞太旺,有制化,亦贵;否则凶夭。 
  
    乙未日丁卯时,不贵则富;卯戌亥丑年月,吉。 
    
    己酉日丁卯时,九成十破,未年旺。年月通身生旺,干头 有辛癸制伏丁乙者,吉。 
    ''',

    '己日戊辰':'''
    六己日生时戊辰,其身得位遇财神; 田园富贵多诚信,甲乙提纲禄贵人。

    己日戊辰时,财库专位。已以壬癸为财,辰上入墓,己土 专位。为人诚信富贵。
    若通月气或甲乙透出,是生月带禄、大 贵。辰月,身旺,不得父母力。见甲化土者,大富。
    冬夏,财 旺生官、富贵。西运,平常。 

    己丑日戊辰时,身孤。寅卯月,禄旺。辰月透甲,作化气 看,贵。午,富厚。寅酉,风宪。
    年月子丑透甲,行东南运, 金紫,近侍;怕西北运,退职。 

    己卯日戊辰时,卯月,风宪。水木年月,行东北运,并同。 

    己巳日戊辰时,身孤后发。春官贵;夏平稳;秋凶暴;冬 财旺。岁运同。 

    己未日戊辰时,丑月,杂气财官,吉。寅辰巳亥午戌年月, 文章贵显。 

    己酉日戊辰时,春官旺,夏平吉,秋暴狠,冬财旺。

    己亥日戊辰时,丑月,杂气财官,贵。戌月,木水运,六、七品。寅午子辰年月,大贵。 

    辰时己日不寻常,内有钱龙镇库藏; 比劫不逢行运吉,定教富贵广田庄。 

    己日戊辰时遇,身逢旺库丰盈。果然花谢再重荣,丑戌刑 冲财盛。
    壬申财官双美,妻重子晚方成。双亲雁侣事中平,独立自成之命。   
    ''',    

    '己日己巳':'''   
    六己日生时己巳,金神与火两相和; 不通月气平常看,月气如通荣甲科。 
    己日己巳时,金火相合,己以丙为印,巳中有丙,健旺; 己巳又为金神,坐于火位,相合。若通火月气,四柱不见财星 
    破印,不行财遇,发福非常。若不通月气,或在冬生,虚秀不实。不通,得南运,亦吉。 

    己亥日乙丑时,夏生,资财满目,行乐轩昂。冬,平常, 戌月、东南运,国师、金紫。寅月,亦贵。 
    己日重逢己巳时,金神化旺要相宜。南离运步财官显,寅卯东方遇亦苛。 
    己日时逢己巳,夏生丙火金神。不遇戌亥与庚申,无破声各响应。父母一衰一旺,刑空事业逡巡。要知显达改名庭,火旺南方之运。 

    己丑日己巳时,辰月,西北运,贵。午未火旺,大贵。申子戌巳,亦吉。

    己卯日己巳时,夹辰财库,主大富。又,卯以巳为驿马, 二己通看,谓之坐马。再生午月,禄马俱有,尤为贵命。
    亥月, 财临旺地,官遇长生。巳月,金神遇火,皆主大贵。 

    己巳日己巳时,午年月,权威赫赫,名誉昭昭。春月,子孝妻贤。秋冬平常,贵而不显。辰戌,财印官食;申,伤官生财,俱作吉推。 

    己未日己巳时,拱禄格。若无羊刃七煞,午字填实,不犯空亡,主显贵。亥丑辰申年月,行东运,文武极品。此格不如丁巳、丁未,以丁正禄,巳寄禄故也。 

    己酉日己巳时,夏生,金神入火乡,贵显,岁运同前。 
    ''',

    '己日庚午':'''  
    六己日生时遇午,禄归时地主昌荣; 柱中怕有官星见,若是伏晶另一评。 
    己日庚午时,日禄归时。已见庚为伤官,乙为正鬼;午上有明庚合乙,伤官合煞,主人独立有成。
    若年月无乙而伤官临于败地,柱有甲、丙二字,伏晶格,不损格局无冲破,主大贵。   

    己逢庚午时归禄,无破无冲能发福; 柱中丙申若相逢,德润身兮富润屋。 
    己日时逢庚午,名为背禄伤官。冲刑破害祸多端,骨肉六亲冰炭。 
    甲丙柱中如遇,伏晶之格清闲。月中丹桂任高攀,富贵不须推算。 

    己丑日庚午时,寅月生,贵;夏凶;秋暴;冬,财旺子少。

    己卯日庚午时,已禄居午,年月有甲丙及寅午者,大贵。卯月,煞旺庚合,权贵。 

    己巳日庚午时,贵。寅午戌月,金神入火乡,作印绶论,贵显,辰戌丑未年月,侯伯。若逢合煞运,必不善终。酉月、东南运,贵。 

    己未日庚午时,背禄伤官,六亲刑克;无破,晚年发旺。未戌年月,贵。 

    己亥日庚午时,午戌年月,财官禄印,大贵。寅年午月,巨富。卯月,西运。贵。 
    ''',

    '己日辛未':'''  
    六己日生时辛未,食神官库喜相亲; 木通月气须言贵,月不通兮富命人。 
    己日辛未时,食神助官。己以辛为食,甲为官,未为官库, 未上有明辛暗甲。若有倚托通月气,贵。食神生旺,胜过财官。通木气月,官旺,尤贵;不通,主福。通运,亦贵。    
        
    己日相逢辛未时,灯窗寂寞有谁知; 运行财旺兼官旺,名利双全莫恨迟。 
    己日时临辛未,食坐官库要开。丑戌刑冲显官财,镇闭前程阻碍。君子文章福助,常人商贾奇魁。匙开发福命中该,财去财来常在。 
    
    己丑日辛未时,不贵即富。通土气月,富。通木气月,贵。一云刑,凶。 

    己卯日辛未时,酉戌亥卯,未年月,贵,行东南运,金紫。 
    
    己巳日辛未时,金神日。寅午戌月生,贵;亥卯辰午,行金火水木运,大贵。 
    
    己未日辛未时,春夏、丑月,丰姿特达,言语清辨,名高禄重。秋冬,平常。木火运,刑害发财。一云财中自害。 
    
    己酉日辛未时,春反复;夏吉;秋寿促;冬财帛丰厚。卯月金水运,五品以上贵。丑月西南运,郎官。辰戌,财印库地俱吉。一云凶刑后旺。 
    
    己亥日辛未时,春贵,夏稳,秋贫,冬富。酉月,己土长生,食神遇禄,享受自然。一云贵中凶失。 
    ''',

    '己日壬申':'''   
    六己日生时壬申,损败天元气不全; 若失天元无倚托,非穷即夭命难延。 
    己日壬申时,水旺土虚,己以甲为官,壬为财,庚背禄。 申上庚旺壬生甲绝,己土气败。若通四季土气或通土气运,吉。 
    若失天时无倚托,不通月气,非贫即夭;不然残疾,末狼狈。 
            
    日干是己会申时,无破无冲最合宜; 柱中纵然官不现,也交财旺定根基。 
    壬申时逢己日,就中三合为宜。天乙贵人正人提,宜用财官显贵。戊己辰戌得位,文章广学须知。妻贤子孝福文齐,刑破中 年不利。 
    
    己丑日壬申时,酉年月,天干透印,富贵好礼,为人慨慷。辰戌吉。亥年,乾清坤夷大格。寅申,官贵相辅,俱吉。
    
    已卯日壬申时,辰月,杂气财官,早贵。亥月、南方运, 五、六品贵。寅申年,三、二品贵。 
    
    己巳日壬申时,大凶,刑。己酉丑月,伤官,行财运,吉。寅午戌月,金神入火乡,运西南,贵。申子辰月,木火运,贵。 
    
    己未日壬申时,巳月生,贯朽粟陈。亥子寅月,金火运, 侯伯。辰亥年月,近侍,贵。 
    
    己酉日壬申时,巳酉丑月,伤官伤尽,吉。寅月,凶暴。 卯未,武职。子未公侯。一云主心狂贤病,大贵。 
    
    己亥日壬申时,卯未、三合会官,干透印,大贵。戊子月, 财旺生官。酉己土受生,干透甲丙,俱吉。
    ''',

    '己日癸酉':''' 
    六己日生时癸酉,沐浴之乡水土浑; 财食支藏多聚散,身衰失地寿难存。 
    己日癸酉时,水土浑浊。己以癸为财,辛为食。酉上癸病, 辛旺,比肩夺财,财多聚散;更身衰失地,主成败反复;不然, 寿促。若通身旺月或运,吉。   
    
    己逢癸水酉时生,食神生旺自从容; 身弱更兼冲克破,此命依算只中平。 
    己日时逢癸酉,偏财喜遇食神。雁行无倚靠双亲,性格情怀不定。财来财去聚散,眼前广见难存。花开花谢再重新,此命先逆后顺。 
 
    己丑日癸亥时,春平;夏稳;秋伤官伤尽,有威权;冬富。如丙寅巳月,金神遇火,贵。丑月,金水运,郎官。透乙,大贵。 
 
    己卯日癸酉时,时日相逢卯酉,主迁移;刑伤又伤官带煞, 主性凶暴,作事迟延。生四季月,吉。 

    己巳日癸酉时,巳酉丑月,伤官伤尽,居武职、风宪。卯戌月,金神入火乡,贵而能言,伤贵,收心早退,以水土败在酉故也。 

    己未日癸酉时,戌亥丑辰年月,西方运,贵。子巳大贵。卯、辰,近侍不大。 

    己酉日癸酉时,偏财遇食,主峥嵘。丑未子午俱吉。酉月、内戚。如年月己酉全,犯破碎煞,主一生破败,游走无结果。 

    己亥日癸酉时,通土气月,行木火运,贵。 
     ''',
 
    '己日甲戌':'''   
    六己日生时甲戌,妻从夫化为真土; 如通月气禄源深,反此而言平常取。   
    己日甲戌时,妻从夫化。己合甲木化土成局,土神钟秀、 禄源深厚。月中无化,取甲为官,丙为印,戌土上甲木成形, 
    丙火合局。通月气,贵;不通,有刑冲破害者平常,己身虽吉, 父母早失。     
    
    己日时逢甲戌,妻从夫化为佳。库财专待钥匙开,壬申丑神通泰。 
    父母夭孤刑克,雁行花果难谐。若逢时运一时来,家业兴 隆亨快。 

    己丑日甲戌时,克父太旺。辰月生,土厚。居巳午末申,临官、帝旺,吉。亥戌寅卯,土病死,凶。酉辰,三、四品, 
    贵,中年退闲。亥木火运,六、七品,贵。 

    己卯日甲戌时,丙丁午戌年月,干有庚辛制伏官煞,生山明水秀地方,官至二、三品。未酉丑月,行土火运,四、五品。 
    午月、东北运,大贵。子运、木火运,风宪。辰巳有倚托者, 极品。 

    己巳日甲戌时,寅午戌月,金神入火乡,贵显。亥戌年月,官居守令,极有声名。子月、木火运,极品。 

    己末日甲戌时,克陷遭刑。寅午年月,三、四品,贵。戌月、东南运,五品。纯辛卯年月,刑。 

    己酉日甲戌时,辰丑刑冲,财源益进。酉戌相害,名利中平。子月,己贵。寅月,官印,行印运,贵。纯乙酉年月,顽暴。一云孤独离乡。 

    己亥日甲戌时,通土气月,要行木运;通水木月,要行身旺运,俱贵。甲己化土气藏收,如逢匙钥福优游; 假若逢财财不聚,浑如木叶值深秋。 
     ''',
 
    '己日乙亥':''' 
    六己日生时乙亥,官藏煞见未为奇;逢金制煞方为吉,身不旺兮凶可知。 
    己日乙亥时,煞见官藏。己以甲为官,乙为鬼。亥上有明乙暗甲,为官煞混杂。柱中见辛制乙,去煞留官;通月气者,贵显。
    亥上水旺土虚,漂流失业,见财不聚,成败进退;要身鬼两停,方吉。不通月气,通运气,亦吉。 
          
    天元乙亥在时间,驿马长生不等闲; 身旺煞强骈福禄,功名显达自欢颜。 
    己日时逢乙亥,偏官喜遇正财。若逢身旺亦为佳,混杂天元减半。行藏进退无定,六亲雁侣兴衰。运行禄马自然来,富贵清闲自在。
    
    己丑日乙亥时,巳酉丑月,制煞留官,贵。午月,身旺,亦贵。子月、火运、七、八品,贵。卯未,透辛制乙,大贵。 

    己卯日乙亥时,卯月,偏官格,煞重身柔,作弃命看。壬字暗逢,志气轩昂;柱有制伏,行土金运,官至三、四品。丑月,杂气。辰、巳,西运,金紫。亥月,水运,夭。 

    己巳日乙亥时,寅午戌月,金神入火乡,贵。巳月、西北运,官至公卿。卯午,风宪。纯子亥年月,以财党煞,作弃看, 主大兵权。 

    己未日乙亥时,无刑破混杂,清高、富贵,文学堪夸。 

    己酉日乙亥时,春夏,显达;秋,制伏太过,贫儒;冬, 财旺。午巳戌年月,六、七品,贵。寅月,行金火运,四、五品,贵。 

    己亥日乙亥时,年月透辛制,贵;无制,亦主特达。戌月, 风宪。已,亦贵。丑,土厚之宫,官至三品。一云自刑,多成败,晚富。 
    ''',

    '庚日丙子':'''
    六庚日生时丙子，身鬼俱衰退神强；有托荣华无托贱，鬼逢生旺寿难长。
    庚日丙子时，身鬼俱衰弱。庚以癸为伤，丙为鬼。子上庚死、丙火无气、癸水健旺。
    若身有倚托，吉；无倚托，又行身衰鬼旺运，飘风夭贱。通火气月，要行西运，贵。身弱不然。

    庚日相逢丙子时，伤官合局不为奇；双亲祖业难成就，燕寝鸾栖别立基。
    庚日时逢丙子，刑官背禄安身。双亲克陷早难辛，雁侣不能和顺。废学经商发福，田庄后懒先勤。
    家居财帛晚才成，先暗后明之命。

    庚子日丙子时，贵。年月再子，并冲，午中丁为官，己为印，人飞天禄马格；柱无财官填实，主贵；
    为僧道，一尘不染，万法皆成；为常人，有名有利，刑伤妻子。一说先贫后富。忌己巳月，破刑，贫。癸未月，孤单。巳亥月、刑。

    庚寅日丙子时，春生，带财带煞，行金水运，金紫。夏，煞旺，大贵。秋，身旺，须行南运，贵。冬，身鬼俱弱，平常。
    纯午年月，位至公卿。壬子，食前煞后随；一阳生后，丙火有气，贵极人臣。忌癸酉月，破败，凶。辛亥月，血光。甲子月，夭。

    庚辰日丙子时，月通木火气，行西运，妙。乙巳月，破败，刑。丁酉月，旺中刑，凶。己丑月，破败，凶。

    庚午日丙子时，贵。时日相冲，忧伤妻子，运喜西南，通火木月气，风宪三四品。
    秋生，丙火无气，难为子息。忌己巳月，破祖，凶。己亥月，被劫盗，凶。癸丑月，孤。

    庚申日丙子时，申月，生土厚地方，贵。辰未年月，行西运金，方吉。辛巳月，凶刑。辛亥月，孤夭。

    庚戌日丙子时，春夏生。西南运；秋月、木火运，俱贵。忌乙巳月，凶、破。乙亥月，官灾多，凶刑。
    己丑月，破败，凶。戊戌月，恶死。

    ''',     

    '庚日丁丑':'''
    六庚日生时丁丑，贵地逢官火太轻；木火运通轩冕客，不通独立只虚名。
    庚日丁丑时，金重火轻。庚以丁为官，以己为印，丑上丁火气轻，己土正位。
    若通木火气月，官印逢生旺，贵；不通，虚名而已。通火土生旺月，富；不通，运遇亦主名声。

    庚丁相合丑时全，好象明蟾耀碧天；不遇刑克真稀奇，财官兴旺更长年。
    庚日时逢丁丑，正官、财库相随。午未戌月福优余，庚取时逢金柜。金逢火而成器，
    必然荫子封妻。从来歌酒不相离，定主清闲乐意。

    庚子日丁丑时，春夏，贵；秋平常；冬孤克。庚寅日丁丑时，魁元。寅卯午未亥月，清秀高命。
    行午、未运，贵显。通火土年月，贵。

    庚辰日丁丑时，丑月，富而寿促。己，近侍，大贵。通火旺土生月，贵；不得，运遇亦富，有名誉。

    庚午日丁丑时，通土月气，贵；不，亦富，有名声。

    庚申日丁丑时，丑月，金火运，极品。辰巳午未戌月，官印两旺，贵。申、酉，身太旺，须行木火。
    寅、卯，财太旺，须行金水。亥子，金寒水冷，须行火土运，贵。

    庚戌日丁丑时，春财旺；夏官旺；秋平淡；冬无力。
    ''',    

    '庚日戊寅':'''
    六庚日生时戊寅，火生金绝福高人；月通从革或秋降，却做皇家柱石臣。
    庚日戊寅时，火生金绝。庚以丙为鬼，戊为倒食。寅上有明戊、合癸化火，庚金气绝。
    若不通金旺月，无救助者，夭贱贫下。巳月，庚长生，丙健旺，身鬼俱强；运行西方，勇暴，武贵。
    申酉丑戌月，金火合局，化鬼为官，更得身强运，贵。   

    庚日寅时甚可夸，无刑克破显忧华；运来自有高人助，时至如添锦上华。
    庚日戊寅时秀，编印倒食难收。少年未遇莫心忧，此命或贫或富。
    时至发财发福，运来顺水行舟。月中金水更相投，无破功名成就。

    庚子日戊寅时，寅午年月，登科显达。纯申，三、四品贵。丑月、金火运，公卿。

    庚寅日戊寅时，月通火局或秋生，行身旺运，贵。庚子月，自死。年见辛酉，贫夭残疾。身衰见丙太旺，同论。

    庚辰日戊寅时，春夏生，干透丙丁，运行身旺，贵。

    庚午日戊寅时，寅午戌月，金衰火旺，当带残疾。纯寅，反主极贵。秋，金旺，多贵，但忌时遇亡劫，克身则凶。

    庚申日戊寅时，时日并冲，忧伤妻子。寅卯辰月、火金运。侯伯。春月、西南运，大贵。寅月，贵显不久。一云先刑后吉。

    庚戌日戊寅时，贵。戌月，杂气财官印绶，贵。庚辰年，己卯月者，侯伯。
    ''',    

    '庚日己卯':'''
    六庚日生时己卯，胎生元命发因妻；柱中有托逢庚旺，财禄丰盈福寿齐。   
    庚日己卯时，胎生元命。庚金卯上受胎，见己为生气印绶。庚以乙为财，卯有旺乙，因妻发福。
    若柱旺丁，生月带禄者，贵；有倚托者，富。通生气财旺者，生财旺运者，俱贵。   

    天元庚己卯时连，禄见文书富贵全；四柱无刑冲克破，贵人接引上青天。
    庚日时逢己卯，财官运气亨通。若无刑冲定褒封，有破中年不顺。
    雁行六亲难靠，自成家计无穷。时来发达显功名，自有高人引用。

    庚子日己卯时，子卯相刑，忧伤妻子，子年月，贵。丑未，官至三品。一云破祖失土，大贵。

    庚寅日己卯时，亥卯月，财星格，早荣早退。午戌，三合官局，干透金水，行西北运，吉。

    庚辰日己卯时，孤。年月通木气及有倚托者，贵。

    庚午日己卯时，刑破。申子辰己酉丑，俱行东南运，贵。寅午戌亥卯未，须得西北运为佳。

    庚申日己卯时，卯月，财星格，不贵即富。丑巳年月，翰林清贵，官至亚卿。一云少贫，中年有小灾，克妻少子。

    庚戌日己卯时，少孤母贱，中年贵。卯酉辰丑月，官至公卿。
    ''',              

    '庚日庚辰':'''
    六庚日生时庚辰，金火秋生气象纯；若有魁罡包贵贱，财官喜忌六官分。
    庚日庚辰时，金水清白。六庚之中，庚戌庚辰为魁罡，怕见财官刑冲；不见，主为人粗豪暴勇而贵，见则祸患百出。
    庚子。庚寅、庚午、庚申，喜见财官。生秋月，为人秀丽，不贵则富。若身不化，得甲乙丁透出，生火木分野，亦作财官论。
    喜月气通运者，吉。

    六庚时辰仔细推，辰中印库钥匙开；四柱若有冲刑字，安然福禄自天来。
    庚日庚辰时正，地支三合为魁。就中卯戌库门开，无破紫袍金带。
    巳午丙丁减副，谋为财去财来。妻重子晚命中该，富贵清闲自在。

    庚子日庚辰时，申月生，井栏叉格。柱并运不见丙丁巳午寅戌字，贵。纯卯年月，位至公侯。

    庚寅日庚辰时，龙虎拱门。年月通火土者，贵。纯庚辰，王侯；不然，极凶。若年月遇木火，运再行，极品。

    庚辰日庚辰时，魁罡，年月不见财官并戌字，贵；冲破者富。申子年月作井栏叉，行西南运，吉。
    纯庚辰，庚申或乙酉化金通无火气，凶徒小人。一云刑。

    庚午日庚辰时，自刑，金神入火乡。申月，行火木运，官可六品。

    庚申日庚辰时，子、申年月入井栏叉。柱、运不逢丙丁巳午字，贵。纯庚申、庚辰，行西北东运，武职极品。

    庚戌日庚辰时，魁罡，土厚地方，官高禄重。子月、西南运，贵。寅辰年月，平常。
    ''',        

    '庚日辛巳':'''
    六庚日生时辛巳，偏官合刃自身生；为人刚毅妻财损，运到金乡贵禄享。
    庚日辛巳时，阳刃偏官。庚以辛为刃，丙为杀。明辛暗丙，合煞为权。通身旺月，贵；不通，无贵，寿考。

    庚日相逢时已生，为人福禄依稀平；刑冲破害柱如有，自立自成免祸惊。
    庚日时临辛巳，败财暗鬼偷寻。财去财来小人侵，祖父家基难荫。
    外合重行发福，兄弟雁行无音。妻迟子晚喜开心，先苦后荣之命。

    庚子日辛巳时，春富；夏、秋贵；冬贫。辰戌丑未年月，印绶，行西南运，贵。

    庚寅日辛巳时，巳酉丑月，身旺，贵。煞旺身弱月，贫。纯申年月，大贵悠久。亥月，东南运、主有权贵。

    庚辰日辛巳时，巳酉丑月，身旺，贵。煞旺身弱月，贫。纯申年月，大贵悠久。亥月，东南运、主有权贵。

    庚辰日辛巳时，终蹇。年月不见财，高。通木气，行西南运；未申，东北运，俱贵。一云先无后有。

    庚午日辛巳时，巳午卯年月，进士风宪。巳申酉戌，行土木运，侯伯。

    庚申日辛巳时，刑。巳酉丑月，特达。春夏，木火旺，财官得地，吉。辰戌丑未，印绶，行南运，贵。

    庚戌日辛巳时，年月遇财，吉。午未，行东南运，文职操权，恐无好终。寅申、翰林宰辅；若行火运，亦难善终。
    ''',  
    
    '庚日壬午':'''
    六庚日生时壬午,官印福宫聚食神; 金士助身须显贵,日逢火旺命难通。 
    庚日壬午时,官印健旺。庚以丁为官,己为印,壬为食。午上壬食无气,丁巳禄旺。通金土月气扶身者,贵。通火气, 官贵太重,反化为鬼;庚金柔弱,不能作福,运气扶身,亦贵。  
        
    庚日时临壬午,支中官印俱藏。贵人禄马更同乡,祸患潜消福长。    
    克破刑冲不吉,柱中更忌空亡。将星天乙主荣昌,中暮家业兴旺。

    庚子日壬午时,时日并冲,忧伤妻子。通金气,贵。火气,大贵,但多忧劳禄。 
    
    庚寅日壬午时,辰戌丑未巳申酉月,身旺,俱贵。寅午,火旺,运气再遇,寿促;不然,残疾。 
    
    庚辰日壬午时,食神旺,善饮食,有操持,发即死。 
    
    庚午日壬午时,寅午戌月、金柔火旺,畏缩残疾。亥子午月、行木火运,贵。
    
    庚申日壬午时,禄马同乡,最吉。如午未年月,位至台阁。卯辰已,贵。戌月、行火土运,清虚冷职。 
    
    庚戌日壬午时,卯月,正财,吉。未月,杂气财官,贵。 辰丑月同。 
    
    壬庚会合临午,无破无冲福自来;从此名利皆有望,贵人举荐上天阶。  
    ''',

    '庚日癸未':'''
    六庚日生时癸未,官星魁制权星退; 柱中见己不透丁,却能显达得官位。 
    庚日癸未时,印财库,庚以乙为财,未中入库,用丁为官, 己为印,未中己丁却有明癸制之。柱有己制癸,不透丁字,居官显达。若无己透丁,为祸百端。通火土运气,贵。
        
    庚日未时库有财,钥匙开处独为魁; 运至财旺生官地,富贵荣华不用猜。 
    庚日时逢癸未,喜逢丑戌荣财。伤官背禄库难开,祖业盈全有碍。 父母夭孤空克,妻要迟子晚和谐。运行吉地免生灾,官旺财乡通泰。
	
    庚子日癸未时,年月无丁透露,有己土制伏癸水者,贵。 
    
    庚寅日癸未时,贵。辰戌丑未月,高。夏富。岁运同,巳 酉申月,身旺,大贵。 
    
    庚辰日癸未时,魁罡日。辰中有土制癸。年月无丁;贵。卯月,金水运,七品贵。 
    
    庚午日癸未时,贵。酉申巳亥年月,总领兵戎,官至二品。先虚后实。 
    
    庚申日癸未时,酉月,武贵,初年剥权。年月寅午戌、申子辰二局相参,贵。 
    
    庚戌日癸未时,戌月、东方运,贵。辰月卯年,大贵。秋 生最吉。夏,须行西北运。方吉。 
    ''',

    '庚日甲申':'''
    六庚日生时甲申,归禄带财格最纯; 巳丙与寅柱不见,功名富贵自然臻。 
    庚日甲申时,日禄居时。庚金申上见禄,甲为偏财。柱中不通丙火,巳寅冲刑,主贵有平常。岁运同。     
        
    日禄居时喜遇申,柱中嫌巳丙和寅; 时来若遇高人荐,柳红桃红万里春。 
    庚日申时为主,是名财禄相扶。生长清闲好诗书,禀性无嗔无怒。 运拙农商工贾,时来职位迁除。高人见喜小人扶,无破青云有路。
    
    庚子日甲申时,时犯日禄,见财星,柱无巳寅丙,富贵双全。辰戌丑未土能生金,吉。寅午戌,平常。申酉,行火木运、贵。寅亥,三、四品,贵。卯,刑。子,多凶。 
    
    庚寅日甲申时,寅、亥月,官至三品。 
    
    庚辰日甲申时,日魁罡,又归禄,俱不喜财官、柱无寅午戌丙丁巳字,贵。 
    
    庚午日甲申时,贵。通身旺月,无丙巳寅午丁,伤破,贵。 
    
    庚申日甲申时,贵。无卯午未戌丙丁字,贵。子丑月,金水运,文贵。余见庚申、甲申,专禄归禄。
    坚金非火不能锻炼, 故巳午戌月生者,多贵。看归禄有七法,勿以为嫌。财月最吉。 
    
    庚戌日甲申时,寅巳午戌月,妻贤子孝,贵。《神白经》运:金水带印,主清闲之福。 
    ''',

    '庚日乙酉':'''
    六庚日生时乙酉,金中相会化真金; 柱中无火多刚缺,有火相成贵气荣。 
    庚日乙酉时,气化真金。庚以乙为财,辛为刃,酉上财绝刃旺。若化真金,柱中无火,金太刚则缺;行火运,造化抑扬, 得合中道。
    庚辰日最好年月带马,三、四品贵,但主少子或不肖。 
    
    天元化合酉时生,生月之中见土亨; 荣遇财官皆显达,功名利禄沐恩荣。 
    庚日时逢乙酉,就中合化真金。财官运步福源生,文秀聪明为甚。不遇亥子克妻;贵贱举失胸襟。凡事后吉先多凶,人品显达之命。 
    
    庚子日乙酉时,主富。月通火气,贵:不通,平常,运通亦称意。卯亥年月,帅阃。一云破祖刑凶。 
    
    庚寅日乙酉时,刑。寅午戌吉。申子,凶暴。 
    
    庚辰日乙酉时,刑。寅卯午年等月,二品权贵。戌亥大贵。《神白经》云:化金,主福厚。 
    
    庚午日乙酉时,刑,中贵。寅午戌亥卯未二局,贵。已, 亦吉。 
    
    庚申日乙酉时,真刑。寅午戌,大贵。已酉丑,中贵。申子辰,富。亥卯未,凋零,一云财吉。 
    
    庚戌日乙酉时,刑后发。寅午戌,官星明朗,贵。亥卯未, 富或五、六品贵。已酉丑刃旺持权,主发迹于疆场,武臣最宜, 文臣亦主掌兵权,究竟受羊刃之祸。 
    ''',

    '庚日丙戌':'''
    六庚日生时丙戌,金火持争事不详; 身旺月通印绶吉,不通无救祸难当。 
    庚日丙戌时,金火持争。庚以丙为鬼,丙火、戊土合局,金无气。若通身旺印,卯月有救助者,贵;反是平常或夭贱。 
    运通亦吉。庚属大肠,若丙丁旺甚,主痔漏、脏毒、脓血之灾。    
        
    戌时官库最为魁,丑戌相刑库自开; 初主中年无显达,没年晚景称心怀。 
    庚日时逢丙戌,偏官仓库埋藏。就中鬼贼不相当,身弱钱财虚荡。运旺身强发福,雁行骨肉参商。妻重子晚免刑伤,老 景封侯拜相。
    
    庚子日丙戌时,春,偏官用财,吉。夏,煞旺身衰,凶暴。秋,身煞俱旺。已酉丑月,西方运,腰金衣紫。寅亥子月,金绝病死,多贫贱。一云聋哑、犬狼伤。 
    
    庚寅日丙戌时,申子辰月,偏官有制,吉。秋生,身煞俱旺,有禄权。纯午,孤贫无倚,不然残疾。丑午行西南,公卿以上贵。纯寅,亦贵。
    
    庚辰日丙戌时,时日相冲,忧伤妻子。月通金水气,贵。木火气重者,艰辛,贫夭或残疾。 
    
    庚午日丙戌时,申酉亥丑、富,贵三品。已午未申,透出壬字,艮坎乾方运,卿相有寿。 
    
    庚申日丙戌时,戌亥年月,东南运,贵。申月,大贵。 
    
    庚戌日丙戌时,辰戌丑未、印绶生助,吉。申子辰,偏官有制,贵。月通金气,不透壬字,行北运,贵。 
    ''',

    '庚日丁亥':'''
    六庚日生时丁亥,官星失地自身衰; 不通月气难成福,若见魁罡却妙哉。 
    庚日丁亥时,庚以甲为财,壬为食,丁为官。亥上丁火无 气,壬旺甲生,庚金失地,难任财食。
    若不通身旺月,不能成福;通月气、有阴土扶身者,发财。官星有助,稍贵。庚戌, 庚辰此二日魁罡,不宜财官生旺;时逢丁亥,反贵。 
           
    丁亥时逢庚日排,重重喜色照朱扉; 桃红烂漫日时绽,一阵春风自显威。 
    庚日时逢丁亥,柱中暗合三奇。要知子旺并三妻,父母雁行可美。癸已戊辛不遇,文章博览多知,无冲无破贵人提,终 
末亨通吉利。 
    
    庚子日丁亥时,贵。申子辰月,伤官、劳碌。卯月、金火 运、五六品贵。 
    
    庚寅日丁亥时,平,初贫,中秀,末主富旺。辰戌年月,贵显。申酉亥卯已午年月,干透乙已者,大贵。 
    
    庚辰日丁亥时,纯未,显达。已午,西北运,风宪、金紫。亥卯、金紫,有权。申月,建禄,最吉。 
    
    庚午日丁亥时,贵。辰戌丑未月,土能生金,荣显。申亥酉月,行木火运,极品。 
    
    庚申日丁亥时,秋生,南运,贵显;北运,平常。 
    
    庚戌日丁亥时,辰已午月,官煞虽混,亦主武贵。丑月,西运,郎官。辰月,西北运,方面。 
    ''',	    

    '辛日戊子':'''
    六辛日生时戊子，印绶学堂坐食神；不见丙丁同午破，必是荣华贵显人。
    辛日戊子时，六阴朝阳。辛金子上长生学堂。辛以戊为印。癸为食，时上明戊暗癸，
    柱中不见丙丁午字，冲开；通身旺月，大贵；犯者不贵。不通月气，通运，亦贵。

    天元六辛子时生，春天花开灿烂明。丙已午丁如破坏，功名难望晚方成。
    辛日时逢戊子，六阴会合朝阳。金神印绶显威光，相助一身荣旺。已午逢之减福，丙离雁侣尊堂。妻子勤助旺家庄、无破寒门将相。   
        
    六辛日见戊子时,谓之天庭清显气。辛酉辛亥得之,最高。忌丙寅月,死不全尸。丙申月,失乡恶死。丁酉月,失亡恶死。 
    辛亥日戊子时,不贵则富。亥月,无官,伤官伤尽,发福子少。春夏,亥子丑,木火运局,金紫风宪。
    
    辛丑日戊子时,丑月,杂气财官,贵。纯丑,儒职。纯辰、行西运,都宪。酉月,东北运,贵。忌庚寅月,刺面,凶。癸 未月,受刑。癸丑月。破败孤凶。 
    
    辛卯日戊子时,春生,寅贫、卯贵。夏清贵。秋羊刃,无益。冬富,丑月尤吉。辰戌未月,财官印绶、俱吉。
    《神白经 》云:金火化,主贵。忌辛卯月,父母凶死。辛已月,大凶。壬申月,尸不全死。 
    
    辛已日戊子时,寅已午月,正官,贵显。亥子,伤官,子 少妻多。卯戌,五品贵。
    《神白经》云:金化象,主贵。忌丙寅月,刑、平。乙已月,先贫。丁酉月,夭。
    
    辛未日戊子时,贵。寅已午酉年月,火木运,贵。亥子, 翰苑。辰戌丑未,杂气财官印,俱吉。忌庚申月,尸不全死。壬子月,孤凶。癸丑月,凶刑死。 
    
    辛酉日戊子时,子酉月生,无丙丁火,不行南运,三、四 品贵。伤妻子;武职权重。
    《神白经》云:金火化,主贵,破祖方发。忌壬寅月,凶死。辛已月,大败,祖凶。庚戌月,凶死。 
    ''',            

    '辛日己丑':'''
    六辛日生时己丑，金土持争势不安；年月财官相救助，免交贫困受饥寒。
    辛日己丑时，金土相争。辛以己为倒食，丑上有明己暗辛。岁月无财官救助者，贫困；得财官运，亦吉。

    己丑时逢辛日险，财官埋没未为奇；六亲骨肉多刑害，年月冲开富贵推。辛日时临己丑，总由倒食淹留。
    就中金柜紧监收，午未戌开成就。甲丙卯寅发福，癸壬亥子漂流。少年谋望事难周，中未前程自有。
    
    辛丑日己丑时,孤浊滞生。申酉月,金旺,运行火乡,疏通,刑伤妻子;为僧道,贵。纯丑,西南运,大贵。 
    
    辛卯日己丑时,寅卯亥未等月,财星格,南方运,贵。辰戌丑未,印绶,南方运,吉。 
    
    辛已日己丑时,丑已申酉月生,金多克木,损伤妻子;僧道,贵。寅卯辰。月,南运,贵。 
    
    辛未日己丑时,寅卯未月,财星格。已午,官显。 
    
    辛酉日己丑时,破祖。已酉丑月,金多克木,俊俏有财, 难为妻子。寅午月,近侍,贵。 
    
    辛亥日己丑时,寅已午月,官星明朗,立计成象。卯未, 财局,富贵。未戌,冲,吉。
    申、子、辰月月,金水氵亟秀, 佳。酉建禄、行木火运、吉。纯亥,金水氵亟秀,贵。 
    ''',           

    '辛日庚寅':'''
    六辛日生时庚寅，财旺生官遇贵神；金木局中通月气，必为荣贵富豪人。
    辛日庚寅时，贵人财官。辛以寅为天乙贵，丙火为官，甲木为财，寅上丙、甲旺，若通金木月气或通运，主富贵显达。

    六辛之日遇寅时，财旺生官互换推；运拙利名应蹇滞，若行财禄更无虞。
    辛日庚寅时遇，弟兄骨肉生疏。双亲祖业靠难成，鸳侣中年违镜。
    亥癸坎壬减福，丙丁巳午驰名。春生冬产贵人钦，中末荣华之命。
    
    辛丑日庚寅时,春贵;夏官旺;秋显达;冬吉。丑月、南运,风宪或武贵。一云发即风疾。年月酉、申金,无火气、贫夭。 
    
    辛卯日庚寅时,午未亥子,俱贵。寅卯申酉,六、七品贵。
    
    辛巳日庚寅时,春贵;夏官禄,行西北运,大贵;秋身旺;冬暴狠。一云刑后有财。 
    
    辛未日庚寅时,已未丑月,名标金标,妻贤子孝,晚年风疾。寅卯午戌,俱吉。 
    
    辛酉日庚寅时,贵。春财聚;夏官禄成;秋身旺;亥子丑戌午酉等年月,俱贵。 
    
    辛亥日庚寅时,贵,主有暗疾。干透丙,发。午酉寅亥年月,南方运,贵。
    ''',           

    '辛日辛卯':'''
    六辛日生时辛卯，妻子难为遇比肩；秋产冬生贫下格，丙临寅马却当权。
    辛日辛卯时，比肩分财。辛以乙为财，卯上乙旺，遇比分夺，损伤妻子。
    生秋冬，财官无气，平常。寅巳午月，干透丙火，丙合辛生，官贵显达。辛卯，悬针煞，柱多不吉。

    辛日时逢辛卯，二辛分夺妻财。雁行鸳侣少合谐，独立自成无碍。
    年月财星生旺，忻然禄自天来。运行比劫事沉埋，木火运中通泰。
    
    辛丑日辛卯时,春、夏生土厚地方,富贵。秋,克妻刑子。冬、艰辛。寅巳午月,近待,贵。甲戌年月、木火运,风宪。 
    
    辛卯日辛卯时,寅午戌月,财官双美,贵显。卯酉申辰年月,近侍,贵;见官印财星,妙。一云先苦,中年大发。 
    
    辛巳日辛卯时,春,财旺;夏、官旺、秋,身强;冬,懦弱。巳酉年月,行木火运,贵戚。申月、水火运,金紫。巳月、西北运,风宪。 
    
    辛未日辛卯时,纯未、丁年月,虽大权贵,不善终。寅巳亥,纯吉。 
    
    辛酉日辛卯时,出身孤苦,中年获福,末年封妻荫子,贵。巳月,官印逢天德,贵当一品。丑月、木火运、中贵。申酉亥年月,东南运,风宪。 
    
    辛亥日辛卯时,春夏,财官双美,贵显。秋冬,背禄逐马、劳碌反复。纯亥,金水氵亟秀,多发高科。辰戌,吉。丑未, 尤吉。
    ''',          

    '辛日壬辰':'''
    六辛日生时壬辰，伤官伤尽倍精神；四柱火虚防克害，九流技艺卜医人。
    辛日壬辰时，暗金沉水底。辛用丙为官，壬为伤官，辰水库，丙辛无气，壬水合局。
    若年月透丙，是伤官见官，刑祸百端，为人气高夸大，秀而不实。不通月气、无倚托者，为人反
    复成败，为医卜艺术。柱有木火身旺，行东南运、贵。

    六辛日干时壬辰，锁闭财官事未能；不通钥匙兼压伏，自古难发少年人。辛日壬辰时遇，伤官伤尽为奇。
    祖业父母早难为，雁行分飞无意。春夏财官生旺，东南方运施为。自谋自立作家资，不得亲人之力。
    
    辛丑日壬辰时,春,财旺,妻贤子孝。夏,伤官见官,然亦多富。秋吉。冬,孤克,多贵。 
    
    辛巳日在辰时,春、显达;夏,平常;有名利,主暴虐。酉月、行东运,贵。戌未,四库全,最贵。纯未,杂气财印。丑未,冲开,主有权贵。 
    
    辛卯日壬辰时,春、伤官生财。夏,行藏反复,或凶暴。午未亦奇。秋,申酉身旺,得火则吉。冬,亥子伤官伤尽,有木土为妙;贵重轻高,未免刑克。辰戌丑未主武贵。 
    
    辛未日壬辰时、身孤。春生,财星格,吉。夏,劳碌。秋, 贵。冬,伤官伤尽,为奇。 
    
    辛酉日壬辰时,春,富贵双全。夏好。秋身旺,贵。冬,白丁;子月,辛生地,学堂,主文学。年月火济,贵。甲戌月, 三品。 
    
    辛亥日壬辰时,贵。春,财旺扶身。夏吉。秋身旺,好。冬,伤官伤尽,自立自成。卯未年月,贵。
    ''',        

    '辛日癸巳':'''
    六辛日生时癸巳，贵气无伤官印强；月气有通兼倚托，早年荣贵姓名香。
    辛日癸巳时，官印扶身。辛以丙为官，戊为印，癸为食神。
    巳上丙戊健旺，癸合化火，赤白文章。若有倚托、通月气者，显达；若月不通，运通，亦贵。

    癸巳时逢辛日干，柱中独喜显财官；运行禄马无刑地，金榜题名步御銮。
    辛日时临癸巳，春生财旺 基。丙丁午年最为奇，破克刑冲不利。
    壬癸庚申无破，功名富贵为的。妻贤子孝两相宜，刑破巳时不利。
    
    辛丑日癸巳时,凶,别父母发福。春夏,吉。秋冬,凶暴。 一云化贵、戒酒。
    
    辛卯日癸巳时,春夏,身弱寿促。秋,身强、劳力辛苦。如月气火木,三、四品贵。 
    
    辛巳日癸巳时,化贵。子午年,寅午戌月,贵,亥卯未,清贵。申子辰,无义之人。辛巳癸巳,两干不杂寅辰,透丙, 俱主极贵。丑酉三合,亦吉。 
    
    辛未日癸巳时,寅午戌月,高命。巳酉丑,身旺平稳。申 子辰,白丁。亥卯未,清贵。 
    
    辛酉日癸巳时,贵显,酒色重。寅卯,财旺,吉。丑,三合全,富贵。 
    
    辛亥日癸巳时,时日并冲,忧伤妻子。春财旺。夏,吉。秋,平。冬,凶暴。酉午年月,木火运,风宪、都堂。 
    ''', 

    '辛日甲午':'''
    六辛日逢甲午时，暗鬼枭神真可畏；若无倚托反劳生，莫道六辛逢马贵。
    辛日甲午时，鬼旺身衰。辛用丁为鬼，己为倒食，甲为财。甲午木死则神无气，丁己健旺，虽见午为天乙贵，平生反复；
    纵通旺气，亦贵不永。若生火土月，西方运，贵。
    
    六辛日干时甲午，财神无气不相当；春生木旺财官运，一路滔滔姓字香。
    辛日时临甲午，妻财无气身衰。干强火旺为鬼胎，火重金柔炼坏。
    最忌用神伤损，金沉海底生灾。无刑无破称心怀，贵重光明广大。
    
    辛丑日甲午时,未申年月,四柱有利害,虽富寿夭。通金,虽贵不永。
    
    辛卯目甲午时,卯月,武贵。寅戌,破祖;不然,残夭。巳午七、八品贵。运同。 
    
    辛巳日甲午时,平。寅午戌,官旺,吉。申子辰、平常。卯戌年,官印双全,公候。 
    
    辛未日甲午时,申子辰,偏官有制,吉。丑戌,方面。未 月。贵。 
    
    辛酉日甲午时,春,财旺;夏,官贵,俱吉。秋,身强,虽富不永,冬,平常。 
     
    辛亥日甲午时,亥子年月,金水氵亟秀,文学堪夸。辰戌丑未、杂气财官,贵显。 
    ''',         

    '辛日乙未':'''
    六辛日生时乙未，火木相成金不畏；月通金气与春荣，财旺生官身自贵。
    辛日乙未时，天财入库。辛以乙为财，未上入库；己为倒食，丁为正鬼；
    未上有暗丁，己被明乙制伏，不能为害。若通巳酉丑月者，贵，通火，行西运；通金，行南运，俱贵。
 
    未时辛日库门开，卓立家成自发财；金木运中身旺吉，几经险遇福重来。
    辛日时逢乙未，库中透出偏财。运行木金忌身衰，丑戌之运通泰。
    经历初年发福，鸳帏抵敌无灾。荣华富贵命中排，无破为官清泰。
    
    辛丑日乙未时。刑。亥卯未寅月,财旺生官不贵则富。辰戌丑子,俱吉。 
 
    辛卯日乙未时,亥卯未月,财盛生官,吉。 
 
    辛巳日乙未时,月通金火,贵。运通,亦贵。 
 
    辛未日乙未时,寅卯未年月,财旺生官,名高禄重。通火 气,行西运;通金气,行南,俱吉。 
 
    辛酉日乙未时,月通火气,行东运,贵。辰戌丑未,最吉。亥卯,贵显不久。秋生,身太旺,财官无气,凶夭。 
 
    辛亥日乙未时,亥卯未月,财星格。吉。秋冬,孤独。辰、丑,近侍三品。
    ''',            

    '辛日丙申':'''
    辛日生时遇丙申，月通金火转精神；化成金水逢金地，聚福能为富贵人。
    辛日丙申时，丙辛化水，申上长生。若月通巳酉丑金气者，精神秀丽，文章聚福。
    通火气旺、有倚托者，贵。辛酉、辛未最妙，不成化象。申上官星无气，平常衣禄。
 
    辛日良时遇丙申，天元化合得其真；冬生若也无刑破。贵显当登要路津。
    辛日丙申时遇，长生禄马希奇。天元化合显光辉，职重名高威势。
    君子文章上立，常人荣旺家基。生时真定却无亏，运喜西南东地。
    
    辛丑日丙申时,化贵。少年蹇剥,中贵显。亥月,作化气看。吉。寅午戊巳未月,官星有气;春,财旺,俱吉。 
 
    辛卯日丙申时,化贵。寅巳午未戌酉亥月,官星明朗,山明水秀,登科荣贵。通士气,亦贵。一云少蹇、中、末好。 
 
    辛巳日丙申时,见血则福;又云贵中失。申未年月,身厚, 妻重子孝,武职三品。 
 
    辛未日丙申时,因贵人门下得富。春,清贵。夏,平常。秋,富。冬,大贵寿促。《神白经》云:金水乖合,又化水,主贵。 
 
    辛酉日丙申时,寅巳午戌月,官旺,荣贵。《神白经》云:水化主贵。 
 
    辛亥日丙申时,发福,防孤克带疾。通金气,主人秀丽福厚。通水气,大贵。
    ''',    


    '辛日丁酉':'''
    六辛日生时丁酉，鬼破禄无祸百端；倚托身强方断吉，月通制伏是偏官。
    辛日丁酉时，火金持争。辛金酉上健旺，见丁为正鬼；酉上丁长生，破禄，不成其福，反复成败。
    身强通月气有制伏者，作偏官论；更行身旺运，贵。通金气无丁，身强，行南运，大贵。
 
    酉时辛日等同论，出户相迎喜事新；不遇刑冲空克破，何愁富贵不加身。
    辛日时临丁酉，偏官合局相投。丙、丁重见主淹留，嗣息女多男少。
    祖业残花秋暮，游人皎月云收。身强官旺福优游，运至财官大有。
    
    辛丑日丁酉时,高平稳。酉月、土木运,方面。戌亥子巳未年月,大贵。 

    辛卯日丁酉时,时日并冲。月通金气,不透丙丁,南方运,贵。 

    辛巳日丁酉时,平。亥月,反复不定。午月,偏官带疾,显达寿促。子月,贵戚。一云有财有喜,寿不过三十一。 

    辛未日丁酉时,不贵则富。月通金气,无丙丁字,行南运, 贵。 

    辛酉日丁酉时,年月通金气,吉。丑月,西方运,风宪。寅午戌,贵。 

    辛亥日丁酉时,贵。丑寅卯酉年月;近待、金紫。
    ''',           

    '辛日戊戌':'''
    六辛日生时戊戌，印绶生身坐禄堂；有托福人难靠祖，不通月气是平常。
    辛日戊戌时，禄同印堂同居。辛以戌为禄堂，戌上有明戊为印绶；
    以丙、丁为官，戌上戊土正位，丙、丁火局。若有倚托通月气者，难为祖业。不通，平常。
 
    辛日戌时财库闭，如开须待丑辰来；月中甲丙天干透，富贵荣华不用猜。
    辛日时临戊戌，五行财禄荣昌。柱中辰、戌两相当，名曰钥匙开藏。火水光辉发达，空亡锁闭如常。运行财地并官乡，无破天然福相。
    
    辛丑日戊戌时,刑害。辰戌丑未,印绶,行南运,大贵。寅巳,正官,贵。子午卯酉,武职风宪。 
 
    辛卯日戊戌时,刑害,饕餮。亥,卯月,木火运,五、六品贵。 

    辛巳日戊戌时,辰戌丑未月,印绶,文贵少病;生土厚分 野,贵。戌月,行木火运,风宪。 

    辛未日戊戌时,凶恶狠暴,忧伤妻子。寅巳午戌丑月,贵。申子辰亥,金水氵亟秀,尤贵。一云克父母,身旺,中年富。 

    辛酉日戊戌时,凶刑。巳酉丑辰戌未年月,魁元,卿、尹之命。
    ''',           

    '辛日己亥':'''
    六辛日生时己亥，背禄剥官反破伤；如作飞天禄马贵，失时无合空忙忙。
    辛日己亥时，飞禄合局。辛以丙为官，亥上有旺壬伤，故官无气；如再得亥月或亥日，以亥冲出巳中丙火为官星。
    若是辛西、辛丑合局，贵；其余辛无合。不通月气，无倚托，贫下；有倚托，吉。
 
    辛日天干己亥时，枭神背禄主灾虞；无冲发福亦不重，禄马飞天贵自殊。
    辛日时临己亥，枭神背禄同宫。好如缺月被云龙。壬巳甲寅无用。父母完全不睦，残花结果防风。若无克破与刑冲，飞天禄马福重。
    
    辛丑日己亥时,辰戌丑未及寅卯月生,作飞天禄马,贵。未月,金水运,金紫方面。 

    辛卯日己亥时,寅卯亥未月,财旺生官,终身有庆。巳酉丁年月,贵。 

    辛巳日己亥时,填实巳字,不入飞天格,作官印论,主父母竭力扶持而后富贵。 

    辛未日己亥时,贵。亥卯未寅月,金能克木,为财盛生官,名利贵显,巳午年月,富贵。秋生,透丙,亦吉。 

    辛酉日己亥时,辰戌丑未、杂气财官,吉。纯亥,冲巳中丙火为官,贵。 

    辛亥日己亥时,年月再亥,飞天禄马,三、四品,贵;武职极品;侯、伯。寅巳,填实,则减。子辰年月,亦吉。 
    ''',         


    '壬日庚子':'''
    六壬日生时庚子，子上明庚暗损伤；火土月中仍主吉，不通凶狠只平常。
    壬日庚子时，刃旺身强。壬以庚为倒食，癸为羊刃，时上明庚癸旺，若通火土月气，制伏庚癸，大贵；
    不通，凶狠平常。通运亦贵。
 
    天干壬日时庚子，枭日由来遇劫财；运弱妻儿防克害，运强财禄自天来。
    壬日时逢庚子，劫财倒食流连，运行比劫事忧煎，财禄不能通显。雁侣双亲失意，妻儿迟则团圆，财官运步福滔然，祖业从新改变。
    
    壬日庚子时,刃旺身强。壬以庚为倒食,癸为羊刃,时上明庚癸旺,若通火土月气,制伏庚癸,大贵;不通,凶狠平常。通运亦贵。 

    壬子日庚子时,辰戌丑未月,杂气财官;巳申酉丑,印绶, 居土厚分野,俱贵。寅月,金水运,近侍金紫。
    午月,行西运,六品,子运败凶。若纯壬子羊刃,贫凶。一云,少年富,三十五后艰辛,末大富。忌辛巳月凶恶死,辛亥月大凶,甲子月刑。 

    壬寅日庚子时,贵而刑。辰戌丑未月,杂气财官;巳申酉月,印绶,俱贵。忌乙巳月受刑,丁酉月大破,祖恶死,乙亥月刑。 

    壬辰日庚子时,若寅午月生,财星旺;辰戌丑未,官旺, 俱吉。纯辰,透庚壬,作壬骑龙背格,大贵。忌丙辰月,夭死,尸不全;丁未月破祖,孤;辛丑月大破,刑。 

    壬午日庚子时,时日并冲,女多男少。丑未月,行南运,富贵。余年月,观诸贵命可见。忌甲午月自刑,多是非;癸酉 月大破,失乡恶死;辛亥月恶死。 

    壬申日庚子时,贫、刑。未月,杂气财官,行财旺运贵显,先难后易。辰,会水太旺,须行火土运,吉。
    丑、戌,财官印 绶,俱吉。春冬平常,秋夏吉庆。忌乙巳月受刑,夭;丁酉,夭;乙亥月孤,自刑。 

    壬戌日庚子时,夭。丑月金火运,辰未财官格,俱贵。寅酉,行西北运,贵。申子辰,行东南运,极品。忌巳酉月,孤单凶;丁亥月,凶刑恶死;辛丑月,刑。
    ''',      


    '壬日辛丑':'''
    六壬日生时辛丑，下有官星上印绶；如通月气运西南，官印扶身人清秀。
    壬日辛丑时，官印得位。壬以己为官，辛为印，丑上金局，
    暗已得位，若通月气，为人清秀，禄贵安稳；不通，主性僻诡谲。
 
    六壬日干辛丑时，官印相生事事奇；午月更通金土旺，为官清贵定无移。
    壬日时临辛丑，财官印绶其中，要知开库钥匙通，戊己相逢火重。癸卯乙字减福，
    有遇龙虎相冲，只争迟早改门风，富贵承恩拜宠。
    
    壬子日辛丑时,巳酉丑月,印绶,多受父母荫。申月,火土运,近侍有权。辰戌丑未,有官有印,丰资旷达,名播天涯。寅午戌月,财破,禄印不成局,平常。亥申年月,贵 

    壬寅日辛丑时,丑月,杂气印绶高。辰巳,煞强无制伏, 财官身弱,辛苦。 

    壬辰日辛丑时,辰戌丑未,杂气财官印绶,俱吉。春平, 夏财禄,秋吉,中有凶。冬身旺,须行南运方显。 

    壬午日辛丑时,禄马同乡,贵。夏吉。秋,财官印全,亦贵。 

    壬申日辛丑时,寅卯亥未年月,进士风宪,官至二品,终有起倒。辰戌,富足。申酉,享用自然,行北运亦贵。 

    壬戌日辛丑时,辰月,冲开财官,贵。丑戌,亦吉。柱有乙癸卯字,平常。 
    ''',         

    '壬日壬寅':'''
    六壬日生时壬寅，水火相逢既济论；水木月通财禄贵，不通无救是常人。
    壬日壬寅时，水火既济。壬用丙为财，甲为食，寅上丙生甲旺，壬水无气，若通水局，有倚托，皆贵，不通无救，福薄。
    壬寅日健旺，主大富，如不通月气，亦贵。
 
    六壬逢虎是浮沤，富贵功名莫强求；有印有官为上格，骤然财禄免忧愁。
    壬日壬寅时遇，比肩相遇食神，弟兄雁侣少同群，此是生时定分。坐局运行官地，身强禄位超伦，身衰刑害祸相侵，衣禄平常之命。
    
    壬子日壬寅时,纯子,年月无午冲破,入飞天格,富贵。寅卯巳申酉戌亥年月,俱贵。 

    壬寅日壬寅时,壬趋艮格,土厚地方,山明水秀,腰金衣紫。巳亥年月,武职三品,富厚纯笃。
    寅年午月,行北运,金紫。巳月,行西北运,贵。辰戌丑未,亦吉。纯寅尤吉。一云中年贵,五十后大厄。 

    壬辰日壬寅时,纯辰,壬骑龙背格,干头无丙丁戊己,运行比肩,大贵。纯寅大富。卯戌月,木金运,三五品贵。午月,平常。 

    壬午日壬寅时,少年多疾厄。壬午,禄马同乡。辰寅年月, 二品贵。申酉,高尚,若通木火,才名冠世,贵。戌月,行东南运,方面极品。 

    壬申日壬寅时,巳酉丑月,武职三品。辛卯、戌月,亦贵。子寅,大贵。一云贫而发,亦不久。 

    壬戌日壬寅时,巳月,偏官格,名标金榜,身坐玉堂。纯子,三品,寅卯,行北运,风宪。又,六壬日见壬寅时,名白太虚贵,不久,盛而祸生。
    ''',   


    '壬日癸卯':'''
    六壬日生时癸卯，引归死地势难安；劫财煞刃见伤鬼，倚托若无常命看。
    壬日癸卯时，身死刃生。壬以癸为刃，卯为暗乙，而伤官鬼。
    卯上癸生乙旺壬死，不通身旺月气，无救助及倚托者，夭贱。
    巳酉丑月，印旺无化者，性僻孤高虚诈，通身旺，见金气，行才运，贵。伤官伤尽，行南运，亦贵。
 
    壬癸相逢见卯贵，刑冲破害不周全。月逢二德兼身旺，改祸为祥乐自然。
    壬日时临癸卯，败财背禄相逐，平生反复事疑迟，水到东方失位。须有贵人救助，自身文福难齐，祖财骨肉有盈亏，命主晚成先废。
    
    壬子日癸卯时,子卯相刑,忧伤妻子,贵人提携,财帛盈余,敦厚之命。 

    壬寅日癸卯时,背财败禄,或兴或废。子年月,贵。巳月,财官虽刑,亦贵。辰戌丑未,官煞制刃,俱吉。 

    壬辰日癸卯时,通身旺月,见土金破刃,行财运,贵。 

    壬午日癸卯时,壬居午位,禄马同乡,又值卯时,贵显荣达。巳午年月,武职风宪。 

    壬申日癸卯时,亥卯未寅月,伤官伤尽,妻贤子孝,土厚贵命。纯辰,医卜。子月水木,贵。壬戌日癸卯时,甲癸午酉年月,文贵。申,平常,金火运, 贵。
    ''',   


    '壬日甲辰':'''
    六壬日生时甲辰，壬骑龙背坐食神；柱中有托无刑害，必是荣华富贵人。
    壬日甲辰时，亦为壬骑龙背。壬以甲为食神，辰上壬水合局，甲有生气，食神旺相，通月气者富贵福厚。
    冬月，行卯运，不利。

    时遇甲辰壬日干，喜神重叠福多端；时来早晚功名就，运至申辰作显官。
    壬日甲辰时好，青龙入庙为高，犹如兰蕙出蓬蒿，水木滋生荣茂。时日冲开库旺，自然成就窝巢，运行吉地逞英豪，贵显亲人难靠。
    
    壬子日甲辰时,纯子年月,飞天禄马,无破,六卿。巳酉,大贵。亥,亦贵。 

    壬寅日甲辰时,巳月偏官格,不冲不破,贵显。午,正官,贵。辰卯局全,东方,少年登科,荣贵。 

    壬辰日甲辰时,辰月生,壬骑龙背,大贵。寅月,不贵即富。戌月,杂气财官,冲开辰库,高命。子月,断根损叶,成败不定。未月,金水运,贵。 

    壬午日甲辰时,水火灾。寅辰年月,翰苑宿儒,或居祭酒。纯子,风宪。卯寅,富厚。辰子,儒职。

    壬申日甲辰时,水火灾,丑寅年月,文行武权。纯子,金火运,方面。 

    壬戌日甲辰时,寅申酉月,行南运,贵戚。亥卯未申子辰巳午年月,俱吉。 
    ''',      

    '壬日乙巳':'''
    六壬日生时乙巳，身绝有财不聚财；进神暗鬼来相克，透己相刑是祸胎。
    壬日乙巳时，财旺身绝。壬用丙为财，戊为鬼，庚为倒食。
    巳上有乙木为伤官，丙戌健旺，庚金长生，壬水气绝，柱有己官，祸患百端，傲物夸高。
    若不通身旺月无救助者，贫；有倚托，通旺，或行身旺运，皆吉。

    壬日时逢乙巳临，谋为未遇且沈吟：贵人举荐财官旺，子嗣鸳帏不一心。
    壬日时临乙巳，伤官背禄无取，虽然天乙贵人扶，贵显遇而不遇。谋望云为反覆，生平实事成虚，时来发达改门闾，犹似旱苗得雨。
    
    壬子日乙巳时,贵,但难为妻子,性格刚强,不受击触。戌年月,纯煞有制,行木金运,官至三品。 

    壬寅日乙巳时,孤高,刑妻克子,如为僧道,富贵。 

    壬辰日乙巳时,春平,夏财,秋稳实,冬无助救,主贫苦。 

    壬午日乙巳时,辰戌月,贵。亥月,金运,位至都帅。 

    壬申日乙巳时,身坐长生学堂,财帛进退,名利驱驰。木月,行北运,贵。辰戌丑,俱吉。 

    壬戌日乙巳时,寅年月,入日德格,贵。辰戌丑未,贵。秋印,夏财官,俱吉,春伤、冬旺,看干透何如,亦可取贵。

    ''',           


    '壬日丙午':'''
    六壬日生时丙午，聚财之地坐胞胎；月逢金水须富贵，弃命从来是就财。
    壬日丙午时，禄马三奇。壬以己为官，丙丁为财，午上丁己是禄马，壬水受胎，
    有倚托，通金水月气，就财生旺，主富贵，通火气，亦贵。

    丙午时生壬日强，时中禄马不寻常；运行吉地无冲破，早晚升迁到省堂。
    壬日时逢丙午，亦名禄马同乡，就中既济见文章，志气宽洪海量。不过刑冲破害，自然财禄盈箱。运行财旺及官乡，定是朝中宰相。
    
    壬子日丙午时,公直撑持,孤高而贵。年月子午,字重, 水火既济,极品。 

    壬寅日丙午时,寅午戌月,财星格,但嫌身弱,宜僧道, 吉。秋生,印绶。冬,身旺,行金火运,金紫。 

    壬辰日丙午时,寅午戌月,财旺,大贵。 

    壬午日丙午时,冬日身旺,吉。夏,财多身弱,丑日近侍, 贵。寅午,金土运,独弱从强,弃命就财,高命。 

    壬申日丙午时,通金水月气,贵;不通,弃命就财,主富, 不然,极贫下。 

    壬戌日丙午时,寅月,三合财局,弃命相从,富。秋,身有托,贵。冬亦吉。 
    ''',     

    '壬日丁未':'''
    六壬日生时丁未，夫化妻从格局奇；若是局中通水木，发财发福两相宜。
    壬日丁未时，夫从妻化，壬合丁，未上同木局，贵。若月通木局，有倚托者发财，不通，但有资助，因妻致富。

    壬日时逢丁未临，木化成林忌见金；年月若还无破害，必教富贵福弥深。
    壬日时临丁来，就中暗合妻财，好来丑戌钥匙开，收积钱财广大。年月克冲不犯，天然衣禄安排，鸳帏子息早年乖，中末依然享泰。
    
    壬子日丁未时,月通木气,贵;通金气,富,通火土气,富贵;两全不通,行火土运,亦吉。 

    壬寅日丁未时,丁壬化木,亥卯未,寅月,贵。 

    壬辰日丁未时,辰月生,壬骑龙背局,贵显。寅月,妻重子荣。三合水局,身旺无倚,多贫克妻。 

    壬午日丁未时,春平,夏富,秋贵,冬吉。巳午年月,位至王候。未月,东运,贵。子月,正印、三奇俱藏,贵当极品。 

    壬申日丁未时,大富。巳午年月,或透戊己,富贵双全。 

    壬戌日丁未时,日德,封妻荫子,中年又损妻子。亥子申酉月,贵。巳午,不贵即富。辰月夭,月德贵。
    ''',       

    '壬日戊申':'''
    六壬日生时戊申，长生之地鬼伤身；身强制伏为高命，反此定知贫薄人。
    壬日戊申时，水土混浊。壬以戊为鬼，庚为印，申上庚金健旺，壬水长生，戊土偏官，身鬼俱强，
    为人勇暴，若通旺月，行身旺运，有甲木制伏者贵；不通，聪明不贵，再行鬼旺运，难以显达。

    申时壬戌合天元，运去财官福自然；鬼旺身衰无救助，平生劳碌不周全。
    壬日戊申时显，支干煞旺双全，喜逢辰子两相连，正合衣锦局面。被害刑冲克战，就中文福艰难，运行吉地紫泥宣，富贵妻多子健。
    
    壬子日戊申时,羊刃带煞,贵人提携。巳午年月,近侍有权。 

    壬寅日戊申时,时日相冲,身孤为僧道,吉。如寅午戌或纯辰年月,亦贵。 

    壬辰日戊申时,戌月生,早登科甲,官至方面。寅卯丑申子午等年月,极贵,武职一品。 

    壬午日戊申时,偏官偏印。亥卯未寅月,威权。子丑月,木火运,翰林清贵。戌月,行东南运,高品。 

    壬申日戊申时,壬水长生,居申,煞旺身强,更生亥卯未月,偏官有制,吉。 

    壬戌日戊申时,破滞多蹇。纯酉,巨富。若不通身旺月, 行煞旺乡,不吉。有甲制亦可。戊己土重,主瞎疾平常。
    ''',        

    '壬日己酉':'''
    六壬日生时己酉，明官暗印有扶持；月通身旺人清贵，犹恐恋花贪酒色。
    壬日己酉时，败处逢生。壬水酉上沐浴，辛为生气印绶，酉上辛金旺，用己为官，酉上有明己
    ，若通月气有倚托，行财官运，贵，反是，平常。但犯桃花坐命，风流人物，恋花贪酒。

    天干壬日酉时真，改祸为祥遇贵人；若不为官封品级，晚年享福旺家门。
    壬日时逢己酉，正官印绶无偏，荣枯贵贱是因缘，人自生成便见。乙癸卯冲破克，驳杂财官减半，遭富贵不双全，差了生时难辩。
    
    壬子日己酉时,春平,夏吉,秋常,冬旺。如卯月生,好花酒。 

    壬寅日己酉时,大富贵,喜通水气,行官运,贵。但好花酒,风流人物。 

    壬辰日己酉时,高,月同日,壬骑龙背,大贵。巳月,行东北运,贵。 

    壬午日己酉时,禄马同乡,先难后易。丑寅月,行金水运, 武职二品。 

    壬申日己酉时,官印临门,局中无冲破,禄马双全,不贵即富。戌月生,东南方运,腰金衣紫。 

    壬戌日己酉时,亥寅子月,行财官运,贵显非常。纯亥, 文贵。
    ''',        

    '壬日庚戌':'''
    六壬日生时庚戌，身临财库却为鬼；明庚暗戌相刑克，财禄生平聚散多。
    壬日庚戌时，枭临财库，壬以丙丁为财，库于戌，庚为倒食，戊偏官，
    若通火木月气，有倚托者，贵；不通，财帛聚散。

    壬庚相逢戌时生，库有财官锁闭门；究竟无头多反覆，功名到底似浮云。
    壬日时逢庚戌，支干倒食难容。财官印绶库内封，无钥不能取用。丑酉辰逢作福，更逢丁己成名，但怕克害过刑冲，驳杂如常之命。
    
    壬子日庚戌时,名利进退,庚辛年月,贵。辰丑,刑冲; 酉月,破害,财库得用;巳午,财官旺,俱吉。 

    壬寅日庚戌时,刑妻克子。若春生,平,夏、冬,吉。辰 丑未月,贵。 

    壬辰日庚戌时,夏月,不富则贵,春平,秋稳,冬辛勤劳苦,或为僧道,有财破刑。 

    壬午日庚戌时,禄马同乡,壬自坐禄,有庚辛制甲乙为贵。辰戌丑未年月,吉。申月学堂,文贵大显。亥子水旺,透壬主凶。午戌透戊,煞旺亦凶。 

    壬申日庚戌时,通火木月气,富贵;不通,行通运,亦好。丑戌年月,大贵。

    壬戌日庚戌时,不利妻,主被妻妾害,反覆成败。纯戌,贵。寅丑,武职。申月,长生学堂,修文多贵。
    亥月,建禄,干透财官;卯月,伤官,干透财星,俱贵。未月,杂气财官,丑戌相刑。吉。 
    ''',     

    '壬日辛亥':'''
    六壬日逢辛亥时，印禄相随最是奇；财官不见无冲破，得路青云报尔知。
    壬日辛亥时，日禄居时，无克破，有倚托，柱中不见财官，富贵显达；行东运，大贵；若通气，减福；南方运，不贵巨富。

    壬辛会遇亥时推，白玉休嫌出见迟；长生禄马无刑破，抛却麻衣挂紫衣。
    壬日时临禄马，又为印绶同乡，水从金木自然强，此命极高为上。癸乙暗合咸福，无冲破显文章，积玉堆金满屋堂，荫子封妻之象。
    
    壬子日辛亥时,主父母不得善终,后发不富。亥卯年月,文章进身,大贵。 

    壬寅日辛亥时,艰难中发。未月,杂气财官,敦厚,中年贵,五十后终。亥月,东南运,方面。 

    壬辰日辛亥时,秀贵、恶死,午月,干头无己土,青云得路,若有甲合,为去官留煞,三四品贵。酉月亦贵。 

    壬午日辛亥时,平。丑月,风宪。寅月,禄马同乡,行金水运,方面。戌月,东北运,四五品。丑午,僧道官命。 

    壬申日辛亥时,贵。辰戌丑未,杂气财官,吉。年月干无己土,入日禄格,酉月申卯年,行东北运,显贵。 

    壬戌日辛亥时,少年富贵。亥申巳戌年月,一二品贵。纯戌,水火运,金紫。
    ''',           


    '癸日壬子':'''
    六癸日生时壬子，青云得路最为奇；若无己土冲克破，自有功名显达时。
    癸日壬子时，日禄归时，癸水子上建禄，若年月干支无戊己午未字刑冲破害，三元有倚托，通月气者，文章秀丽，官职显达；
    若通木气月，亦贵。如柱透己，有甲合，亦贵。否则，反覆。

    日禄归时局中得，食神喜遇怕刑冲；伤官莫道伤财运，官不加兮财不丰。
    癸日时临壬子，名为归禄格同，家门白屋也峥嵘，玄武当权禄重。水清宝瓶益盛，文章博览多通，荣迁来历紫薇封，甲午寅亥破动。
    
    癸丑日壬子时,午寅、乙丑,己丑年月,文职四五品,通身旺木气月,无戊己午巳字,显贵。未,风宪。巳午,进士。 
    忌壬寅、乙未、庚戌月,俱刑。乙丑月,下贱。 

    癸卯日壬子时,时日相刑,伤妻克子,近贵;无己土,威 权。若亥巳俱全,进士乌府。
    年月纯寅,伤官生财,非大贵即大富。忌甲辰月凶刑孤,丙申月凶恶死,己丑月刑。 

    癸巳日壬子时,春夏发财福,辰戌丑未,不贵终富。忌戊寅月遭刑,戊申月受刑,己酉月乞丐。 

    癸未日壬子时,申酉月,贵。戌亥,大富贵。寅卯,孤。辰巳,凶。忌壬申月,身不全,凶;庚辰月,凶刑;乙丑月,失土凶死。 

    癸酉日壬子时,行藏进退,少子难为妻家。忌丙寅月,不全尸死;乙巳月,大破凶死;丁酉月,自缢死。 

    癸亥日壬子时,贵。亥月生,飞天禄马,登科甲第,大贵。又癸禄居子,壬禄居亥,日时互换,三四品贵。忌戊寅月,死不全尸;戊申月孤贫;己酉月孤苦。 
    ''',

    '癸日癸丑':'''
    六癸日生时癸丑，支中暗鬼有刑伤；月通身旺防妻损，丑巳遥合贵异常。
    癸以丁为妻，丑中丁火无气，若通身旺比肩之月，防损妻财。柱丑寅多，以寅刑巳，丑合巳，刑出巳中，丙戊为财官，须干头无戊己字，大贵。忌巳未卯破格。

    阴水重重时库收，少年难发莫强求；筹来受过中年后，安坐高堂任白头。
    癸日时逢癸丑，水流金局盈冲，库逢戌未禄财丰，不过空乏难动。无匙少年不显，有匙禄马和同，运来何用苦劳心，发达门庭大庆。

    癸丑日癸丑时,丑遥巳中丙戊为财官,若生丑寅申子酉三合年月,主妻贤于孝,荣贵特达;火土运凶;金水运吉。
    癸卯日癸丑时,日贵格,身孤克,主贵。丑寅辰年月,干支无戊己巳午卯字,极品。 

    癸巳日癸丑时,福德秀气格,学问聪明,英才特达,贵。若纯丑巳年月,大贵。 

    癸未日癸丑时,子丑寅年月,贵,中年富。卯月,行金水运,极品。辰戌,四库全,大贵。 

    癸酉日癸丑时,福德秀气格,学问渊源,行藏进退,难为妻家。 

    癸亥日癸丑时,拱禄格,怕冲破、填实,柱无子巳午未字,大贵。寅午戌月,南方运,六七品。 
    ''',     

    '癸日甲寅':'''
    六癸日生时甲寅，刃复官禄减精神；柱中无有庚申字，刑合财官是贵人。
    癸日甲寅时，刑合财官，癸以丙为财，戊为官，寅刑出巳中丙戊为财官，若柱无官煞及刑冲破害损格，贵；有庚申戊己字，无制伏，不贵。

    甲寅癸日戊丙开，少年未遇且沉埋；若还四柱无冲破，平步登云到省台。
    癸日寅时克应，支干相合光荣，若无壬己戊庚申，必然财禄丰润。运至皇州显达，文章虎榜标名，但逢一字稍空冲，克子伤食剥俸。
    
    癸丑日甲寅时,本贵,丑中有辛金,减其分数。纯水年月, 官至一品。秋生印绶,亦贵。辰月,行东运,贫下。纯申破寅, 凶。 

    癸卯日甲寅时,亥卯未月,至贵。寅卯年月,刑合格,侯伯。寅亥,四品。寅月,西运,金紫。丑戌辰巳,亦贵。 

    癸巳日甲寅时,平,通身旺月,大贵。忌戊己庚申字,岁运同。 

    癸未日甲寅时,主秀实,中年贵显。若生己未己巳年月,武贵。 

    癸酉日甲寅时,金神格。寅午戌月,结火局,贵显特达, 官至二三品。忌丑年,不贵。巳未亥子年月,富寿。辰丑,干透甲丁者,凶。 

    癸亥日甲寅时,子丑未申月,进士,运行金水,风宪。卯戌年月,地支六合,贵。
    ''',    

    '癸日乙卯':'''
    六癸日生乙卯时，长生之地遇食神；众无午酉兼辛巳，福寿双全禄位人。
    癸日乙卯时，食神干旺。癸以乙为学堂食神，卯上癸水长生，乙坐禄，柱中无己破辛夺，
    午酉刑冲，通月气，有倚托，主聪明有寿，居官食禄；若有己土，不贵。春月生，北运，显达。

    乙癸相逢旺食支，天工造物本无私；运行自有高人荐，手攀丹桂上云逵。
    癸日时逢乙卯，贵人食禄之乡，玉堂乙卯位侯王，便是金门将相。君子文章播发，常人财禄盈箱，甲寅辛酉颇安常，富贵荣华大享。
    
    癸丑日乙卯时,辰丑月,高贵。一云:少贱中年贵。 

    癸卯日乙卯时,艰难。生寅卯月,伤官格,难言富贵。未戌年月,技艺近贵。辰丑,吉。己丑、丙子,凶。 

    癸巳日乙卯时,财官双美,春伤官,夏财旺,秋印稳,冬平常。如丑午子亥年月,官至三四品。乙亥、乙酉,残疾。 

    癸未日乙卯时,寅亥卯未月,伤官伤尽,刚断平常。辰戌申子月,贵。 

    癸酉日乙卯时,申子辰月,贵。寅午戌,中。亥卯未,平。巳酉丑,富。 

    癸亥日乙卯时,辰己月,风宪。
    ''',   

    '癸日丙辰':'''
    六癸日生时丙辰，偏官无气未为贫；若无木气通其局，定是清高福禄人。
    癸日丙辰时，身坐官库，癸用戊己为官，辰上土墓为官库，见丙为财，辰为水局，丙火无气，癸水合局，柱无甲破官损库，主贵。

    癸日丙辰官库闭，财星虽透却无气；官要匙开财要兴，柱逢卯戊方为贵。
    癸日丙辰时遇，库中锁闭财官，要逢卯戊钥匙开，守祖六亲阻碍。暗有食神相助，空乏虚度资财，先贫后富命中排，改祖重兴渐快。
    
    癸丑日丙辰时,平。辰戌丑未月,财官有气,贵。 

    癸卯日丙辰时,孤独难为椿萱,有财帛,贵,人钦敬。卯亥年月,日贵格。午戌,九品至五品。寅月,行南运,风宪。 

    癸巳日丙辰时,子月生,南方,山明水秀,地方,高贵。子未年月,富厚。戌卯,近侍。未戌申,儒官。 

    癸未日丙辰时,高。寅卯未月,平常。辰戌丑月,吉,巳月,财官俱旺,贵。 

    癸酉日丙辰时,孤,贵。巳酉丑月,贵。寅卯,不吉。子午,富。戌月,大贵。 

    癸亥日丙辰时,柱无甲木破损官库,贵,运南。     
    ''',    

    '癸日丁巳':'''
    六癸日生时丁巳，贵地逢财遇暗官；有托就看财禄盛，无依必定福偏残。
    癸日丁巳时，癸合财官，癸用丙为财，戊为官，庚为印，巳为天乙贵人。
    巳上庚金长生，丙戊建禄，癸水受胎，若有倚托，通水气月，贵，不通水气。平常。时逢三奇，大抵发于晚年。

    巳时禄马同争先，造化无私产大贤；刑冲减半无空克，运至声名扬九天。
    癸日时临丁巳，贵人禄马同乡，三重蛇马正朝纲，玉殿金阶来往。壬亥申寅减半，只愁运落空亡，果无冲克无刑伤，舞拜凤凰池上。
    
    癸丑日丁巳时,先贫后富,行火水运,发达。 

    癸卯日丁巳时,若子月,身旺财旺,贵显。 

    癸巳日丁巳时,财官双美。子月,贵。火月,富。天干透土,地支午未,主大权贵。纯丑,极品。 

    癸未日丁巳时,寅午戌月,身财旺显,秋冬禄旺,伤残疾。 

    癸酉日丁巳时,先贫后富。巳酉月,官印俱旺。亥卯未,食伤生财,贵显。午戌,财旺,亦吉。 

    癸亥日丁巳时,刑害。春夏月生,好。秋,印绶,吉。冬,平常。庚寅年月,武贵。 
    ''',   

    '癸日戊午':'''
    六癸日生时戊午，化火临时帝旺乡；运喜东南木火地，为官清正禄荣昌。
    癸日戊午时，化气成火局，癸合戊化火，午上帝旺，合局而贵，身旺不化癸水，地方之气引到南方，癸水无气，贵而寿促，东方运吉。

    将星扶禄命高低，见爱于人是与非；得志退毛鸡化凤，虎卧平坡被兔欺。
    癸日时逢戊午，天元既济之方，化为真火显威光，灾难消除福长。壬会甲寅减半，是非成败难防，六亲不睦暗刑伤，难得资财富旺。
    
    癸丑日戊午时,财厚,南运主贵寿促,东运吉。 

    癸卯日戊午时,申子辰亥月,身旺不化,平常。卯戌月, 贵。 
 
    癸已日戊午时,中年大富,若行东运,贵显。申未月,亦贵。 

    癸未日戊午时,寅午戌,化火合局,贵显。 

    癸酉日戊午时,主伤妻家财,有始无终,子年子贵而无禄, 行南运,好。 

    癸亥日戊午时,贵,未月,东方运;金月有制,俱贵显。 
    ''',      

    '癸日己未':'''
    六癸日生时癸未，鬼旺身衰福不齐；月气不通无救助，平常衣禄有相亏。
    癸日己未时,鬼旺身衰。癸以己为鬼,未上明暗二己得坐 专位,癸水无气,浑浊不清,反复成败,若通月制又不通水气者,平常

    偏官暗鬼库中埋，险难惊忧不聚财；丑戌相逢钥匙吉，旺中癸福定无灾。
    癸日时临己未，库中耗鬼身衰，不逢卯戌钥匙开，锁闭不能通泰。
    花落重荣结子，双亲雁侣难谐，纵然先贫后富来，弃旧迎新无碍。
    
    癸丑日己未时,高。年月俱丑,贫薄。辰戌丑未,土旺,主目疾、贫贱。通金木水气,贵。午月,东北运,六七品贵。 

    癸卯日己未时,子巳未年月,二品。巳寅字,刑六亲。 

    癸巳日己未时,财官双美,柱无戊土,有卯木合局,作时上偏官,有制,贵。

    癸未日己未时,高。春偏官有制,吉。夏,平常。秋、冬身旺,申月行木运,显贵。巳辰年,六卿。 

    癸酉日己未时,寅巳申酉丑戌年月,贵。 

    癸亥日己未时,贵。未月生,忠孝双金,官至风宪。如煞官混杂,恐终在外。亥年月,贵。 
    ''',      

    '癸日庚申':'''
    六癸日生时庚申，官星印旺在其支；柱中无己丙寅巳，自有荣华富贵时。
    癸日庚申时，作专印合禄。癸以戊为正官，庚为正印，申上庚旺戊生，以申合巳中戊丙，
    癸日得财官，若有倚托，柱中无财及破害刑冲官印，主贵；柱中有财，行财运，反复进退，少贵。

    癸日庚申仔细推，禹门深处见龙飞；文章得助雄威力，柱合财官世所希。
    癸日庚申时正，印绶齐合官星，亥寅申丙巳刑冲，离合立之身不定。无破黄甲显姓，常人财禄安宁，果无刑害与灾星，便是锦鸡化凤。
    
    癸丑日庚申时,辰戌丑未年月,文章冠世,官至三品。子月坐禄,亦吉。 

    癸卯日庚申时,卯月作合禄格,西北运,贵,金紫。申月, 东北运,风宪。庚辰、庚戌年月,正官格,贵。辰月,金水运, 七品贵。

    癸巳日庚申时,贫,亦是合禄格。未月生,问学有成,西北运,贵;行东北运,亦贵。 

    癸未日庚申时,柱有甲寅,乙卯,己与甲合,乙与庚合, 妻贤子孝,荣华在后。酉申年月,三四品。秋生,行木火运, 二三品。亥卯,文进贵。 

    癸酉日庚申时,卯酉戌寅年月,贵。申酉,火木运,大贵。 

    癸亥日庚申时,性平身孤。卯未月,饱学,贵命。申,亦贵。子申,近侍有权。
    ''',      
    
    '癸日辛酉':'''
    六癸日生时辛酉,自身失地更何有;支中明暗被辛伤,无助利名终不就。 
    癸日辛酉时,明暗枭神。癸见辛为倒食,酉上辛建旺,癸失地,若无倚托救助者,遇贵生涯;有倚托则吉。
    
    天元是癸时申酉,用尽心机度日忙; 官印相生逢印合,胸中便富且如常。 
    癸日辛酉时遇,倒食偏印难禁,柱中无依且安贫,财官月遇亦称。 只怕癸水失地,不能驱驾奚胜,六亲骨肉各西东,一生劳苦之命。 
    
    癸丑日辛酉时,秋月,印绶格,行官煞运,吉。冬,福禄双全。子寅年月,干头无戊己字,贵。 

    癸卯日辛酉时,日贵格,辰戌丑未月,贵。子卯年月,大贵。巳午,亦贵。又云不利妻子。 

    癸巳日辛酉时,孤。寅卯年,辰戌丑未月,贵。子午卯酉, 中贵。寅申巳亥,最贵。 

    癸未日辛酉时,春贫,夏先难后易,秋吉,冬贵。 

    癸酉日辛酉时,申酉月,印绶多,能守祖,破妻家。子巳午月,干透庚辛,禄贵印绶俱全,贵不可言。寅戌,腰金。午亥,大贵。丑月,煞重凶夭。 

    癸亥日辛酉时,戌月,行东南运,金紫;东北,风宪。子月建禄,年遇财官,大贵。 
    ''',          

    '癸日壬戌':'''
    六癸日生日壬戌，支内正官生财库；月兼有救贵多成，倚托若无终不富。
    癸日壬戌时，水火既济，癸用丙丁为财，戊土为官，戊与癸合旺，为人智谋，通月气有倚托者贵；不通，平常；通火土月气，富贵双全；运气通，亦吉。

    天乙壬癸戌时排，库内财官等钥开；不遇刑冲空锁闭，少年难发更生灾。
    癸日时逢壬戌，就中仓库盈余，将星天德两相扶，辰戌钥匙开助。土旺长流水局，六亲恩处成疏，不遇空亡有增余，中末荣华享福。
    
    癸丑日壬戌时,刑,亥月,土厚地方上贵。辰申年月,南方运,状元。五月,南运,都宪。若春秋生,南方运,八九品。 

    癸卯日壬戌时,日贵格,寅巳年月,干透戊丁财官而旺, 大贵有权。卯辰丑午子等年月,文贵。酉戌,金土运,五六品。 

    癸巳日壬戌时,财官双美,春平,夏秋冬贵。辰丑未寅酉年月,风宪。 

    癸未日壬戌时,刑。巳月生,三四品。子庚年月,近侍贵。 

    癸酉日壬戌时,亥子月,才智高贵,妻贤子孝。春平常。夏财官,秋印绶,俱吉。辰丑,刑冲戌库,贵富两全。戌月, 东南运,武贵。 

    癸亥日壬戌时,春生,伤官见官,夏财旺,秋、冬吉,名利有成。戌辰月,行亥子运,贵。子月,行西南运,金紫。
    ''',          


    '癸日癸亥':'''
    六癸日生时癸亥，禄马飞天临旺神；不见官星兼惹绊，必为贵格异常人。
    癸日癸亥时，禄马飞天格，癸水亥健旺，癸用戊为官，丙为财，亥中丙戊俱绝，癸无财官，却亥去冲出巳中丙戊，飞来就癸为财官，
    柱无戊己惹绊及官星破禄，若见庚辛，清白而秀，为人智慧，贵为方面。

    阴水重重透海波，少年未遇且蹉跎；困龙得志方能化，不遇时来虎卧坡。
    癸日时逢癸亥，败财带禄亨通。喜宜秋夏忌春冬，戊丙庚木富盛。巳亥甲丙反复，六亲大不和同。一身不定好翻腾，先败后成之命。
    
    癸丑日癸亥时,作拱禄格。巳酉丑生,福德秀气。午月平常。卯酉月,行南运,金紫风宪,但难为寿。 

    癸卯日癸亥时,平,日贵格。寅卯月,伤官论,行金水运,风宪。辰戌丑未月,官旺。纯卯,三品贵。辰戌与卯刑,主孤 贫。 

    癸巳日癸亥时,丑月,杂气印绶。贵。亥子年月,行南运,贵。又禄马同乡格,巳申年月,大贵。 

    癸未日癸亥时,身下坐财官。辰戌丑未月,行东北运,贵。秋月,东运,七八品贵;干透正印、正官,金紫。 

    癸酉日癸亥时,辰戌丑未月,生涯遂意。酉月,行东北运, 八九品贵。申月,东方运,五品。 

    癸亥日癸亥时,性聪飘逸,中年大富。冬月生,飞天禄马, 无戊巳子字填实惹绊,贵显;不然,孤克为僧道,亦主清高。 
    年月辰亥,干透辛壬,无填实巳字,有智量,大贵。卯月,金紫。巳丑亦贵。
    ''',          

}
